{
	"title": "Accessibility for Devs Series: Online Talks and panel Q&A",
	"hosts": [
		"Elizabeth M.",
		"Marco C."
	],
	"startDate": "2024-11-18T18:00:00-05:00",
	"endDate": "2024-11-18T18:00:00-05:00",
	"status": "canceled",
	"locationType": "virtual",
	"image": "./images/600_522193676.webp",
	"tags": [
		"Events in",
		"Accessibility",
		"Web Development",
		"Web Accessibility",
		"Software Development",
		"Tech Talks"
	],
	"details": "Details\n-------\n\n**This is our fourth Accessibility for Devs event and the second in-person one! Topic and location are TBA but register early as these events will fill up fast.**\n\n**This event will have 2 or 3 talks each geared to a different levels of dev skills/career stage followed by some networking time and a panel Q&A.**\n\n*   Would you like to advance your career and improve your software development skills with accessibility in mind?\n*   Are you curious about accessibility (\"a11y\") but don't know where to start?\n*   Have you attended other web accessibility events, but they seem to be geared more to designers and product managers?\n*   Do you know that accessibility is becoming increasingly important for legal, business, and human rights reasons?\n\n**Well then this is the series for you!**\n\nThe Accessibility for Devs Talk & Workshop Series is designed for developers and run by developers. Every event will have a live coding demo and/or hands on practice so you can level up your skills.\n\n**About** **Accessibility for Devs Talk & Workshop Series:**\n\n*   On the third Monday of every month\n*   Alternating between online and in-person events\n*   Open to all skill levels\n*   Coding focus but no accessibility knowledge required\n*   Run by the new Accessibility Team at TorontoJS!\n\n**Accessibility of** **Accessibility for Devs Talk & Workshop Series**:  \n(Because accessibility isn't just about users!)\n\n*   All in-person events will be wheelchair accessible and have easy access to an accessible subway station or streetcar route.\n*   Online events will have auto captioning enabled and presenters/hosts will do our best to provide described audio of visuals.\n*   Talks uploaded to YouTube will have both captions and transcripts (_Please note: It may take a while for the first few YouTube videos to have captions and transcripts as we are setting up the new accessibility team. We're looking for volunteers!_)\n\n\\*\\*\\*  \n**About TorontoJS:** ℹ️  \n**Did you know that our members and volunteers are not just in Toronto, and that we're not just JavaScript!** We welcome people from any field in tech and with any level of skills - from students and those considering a career change up to seasoned professionals with decades of experience.  \nTorontoJS is dedicated to providing a welcoming, safe, inclusive and supportive environment for all regardless of their gender, sexual orientation, disability, physical appearance, body size, race, or religion.  \nPlease read the [code of conduct](https://torontojs.com/code_of_conduct) prior to attending this meeting. [https://torontojs.com/code\\_of\\_conduct](https://torontojs.com/code_of_conduct)  \nWe welcome and encourage people who are disabled, neurodivergent, deaf/Deaf, LGBTQ2S+, and BIPOC, to attend events, get involved as members and to volunteer!  \n\\*\\*\\*  \n**Connect With TorontoJS 🔗**\n\n*   Website: [https://torontojs.com](https://torontojs.com)\n*   [Join us on Slack!](https://join.slack.com/t/torontojs/shared_invite/zt-zgi31snl-omO3tXSZ0Q7zqN9WBQSf8Q)\n*   Follow us on LinkedIn: [https://www.linkedin.com/company/torontojs/](https://www.linkedin.com/company/torontojs/)\n*   You can also find TorontoJS events on [Guild.host:](http://Guild.host:) [https://guild.host/torontojs/events](https://guild.host/torontojs/events)\n\n\\*\\*\\*  \n**Alt text for cover image:**  \nText: Accessibility for Devs Talk & Workshop Series In-Person  \nTalk and Workshop  \nTopic: TBA  \nLocation: Toronto TBA  \nDesign: Dark theme, black background, white text on the left and centre. Top left:White universal accessibility icon  \nOn the right there's a stylized grey CN tower on a red background that looks like flood lights shining up from the ground."
}
