{
	"title": "JS Tech Talk [In-Person]: Snack Pack",
	"hosts": [
		"Jen C.",
		"3 others"
	],
	"startDate": "2023-03-30T18:00:00-04:00",
	"endDate": "2023-03-30T18:00:00-04:00",
	"status": "active",
	"locationType": "in-person",
	"image": "./images/600_510821777.webp",
	"tags": [
		"Events in Toronto, ON",
		"JavaScript",
		"JavaScript Applications",
		"JavaScript Frameworks",
		"JavaScript Libraries",
		"Web Technology"
	],
	"details": "Details\n-------\n\n\\# **We're BACK with an assortment of talks at [Super.com](http://Super.com)’s office!**\n\nJS Tech Talk is for sharing knowledge about all things Javascript, dev-related or improving our craft and careers.\n\nThe venue holds ~80 people, so please RSVP only if you are coming, and update it if you can no longer attend.\n\nUnfortunately, this event won’t be streamed but we will make best efforts to record the talks!\n\n[Code of Conduct](https://torontojs.com/p/code_of_conduct) is enforced at all TorontoJS events\n\n**Talks**\n\n**Brendan Hugh Ritchie**, \"Super’s Journey with a Component Library\" [https://www.linkedin.com/in/brendanhughritchie/](https://www.linkedin.com/in/brendanhughritchie/)\n\n**Alex Bodurri**, “Demystifying Dependency Injection in Angular”  \nDependency injection is often cited as one of the more mysterious parts of Angular. Let's discover what dependency injection is, and how it gives Angular super powers!\n\n**Simon Macdonald**, “Solving Common Web Components Problems with Server-Side Rendering with Enhance”  \nWhat are web components? How are they different from React? What are common web component problems? How can we use Enhance to SSR web components to improve them?\n\n**Ankita Kulkarni**, “An Engineering Leadership Roadmap”  \nMost early or newly promoted Leaders aren’t sure how to succeed. They continue to act like Individual Contributors (ICs) as they aren’t sure how to manage. Ankita will walk us through an Engineering Leader's Roadmap, so you’ll know what to expect, before and after the first 90 days.\n\n**Schedule**  \n6:00 pm - Doors open  \n6:20 pm - Announcements  \n6:30 pm - Brendan Hugh Ritchie from [Super.com](http://Super.com) -10 min  \n6:40 pm - Q&A - 5 min  \n6:45 pm - Alex Bodurri - 15 min  \n7:00 pm - Q&A - 10 min  \n7:10 - Ankita Kulkarni - 20 min  \n7:30 - Q&A - 10 min  \n7:40 - Networking break - 10 min  \n7:50 - Simon MacDonald -20 min  \n8:10 - Q&A - 10 min  \n8:20 - Networking til End  \n9:00 - Everyone Goes Home\n\n**Speaker Bios**\n\n**Alex Bodurri** (He/Him) is a Software Developer who loves solving problems on the Web. Alex works at Verto Health to help drive healthcare innovation in Canada. He moonlights as a member of the Angular team, with a primary focus on DevTools. [https://aleksanderbodurri.com/](https://aleksanderbodurri.com/)\n\n**Ankita Kulkarni** is a Senior Engineering Technical Leader with over 10 years of Tech industry experience. She is passionate about growing developers and leaders and wants to help them level up in their engineering careers. She worked for several companies such as WealthSimple, IBM, Loblaw Digital - Shoppers Drug Mart, [Rangle.io](http://Rangle.io) and more. [https://kulkarniankita.com/](https://kulkarniankita.com/)\n\n**Simon MacDonald** is the Head of Developer Experience at Begin where he contributes to open source projects like Architect and Enhance. He's one of the co-organizers of the ever popular Ottawa JS Meetup. [http://simonmacdonald.com](http://simonmacdonald.com)\n\nWanna give a talk, do a book club, or run a workshop? Tell us about it: [https://tinyurl.com/torontoJS](https://tinyurl.com/torontoJS)\n\nWanna be an event partner or sponsor? Reach out at [organizers@torontojs.com](http://organizers@torontojs.com)\n\n**Guild Trial**  \nWe're also trialing a new platform for Events & Presentations - Guild!  \nPlease register for this event on Guild by following the link below, in order to assist us with the trial. Thank you!  \n[https://beta.guild.host/events/js-tech-talk-inperson-291705848](https://beta.guild.host/events/js-tech-talk-inperson-291705848)"
}
