{
  "title": "JS Tech Talk [In-Person]  CSS-Edit | Streaming & Coding Contests [RSVP on Guild]",
  "hosts": [
    "Aman A.",
    "sami x."
  ],
  "startDate": "2024-03-27T18:00:00-04:00",
  "endDate": "2024-03-27T18:00:00-04:00",
  "status": "active",
  "locationType": "in-person",
  "image": "./images/600_510821777.webp",
  "tags": [
    "Events in Toronto, ON",
    "JavaScript",
    "JavaScript Applications",
    "JavaScript Frameworks",
    "JavaScript Libraries",
    "Web Technology"
  ],
  "details": "Details\n-------\n\n\\# Spring Revival: Welcoming You Back to Our Energizing March Meetup!\n\nWe would love to welcome you to our March 2024 In-Person Tech Talk Meetup at **[Super.com](http://Super.com)!** 👋\n\nCome out and join us for a special event with our members who are coming together to share their knowledge with the community.  \nWe are still finalizing the tech talks, and will update the agenda when we have more details, but here's a quick rundown of the schedule for the day:\n\n\\## **Schedule:**\n\n**6:00 pm** - Doors Open  \n**6:20 pm** - Welcome notes from TorontoJS  \n**6:30 pm** - Welcome from our hosts - [Super.com](http://Super.com)  \n**6:35 pm** - **Beyond Text Editing with CSS-Edit** - by [Marcelle Rusu](https://www.linkedin.com/in/marcellerusu)\n\nMarcelle has spent the last 2 months working full-time on a from-scratch structural editor for css.\n\nThey are going to talk about the experience of having the freedom/pressure of working on DX full-time, the current state and dreams for the future\n\n**About Marcelle:** \"Marcelle Rusu (they/them) is a solo developer deeply passionate about client-side programming, language design, and DX tooling. They have done front-end work for about 5-6 years ranging from react, svelte, and even elm. \"\n\n**7:15 pm** - **Web video streaming and the rise of coding competitions** - by [Daniel Stoianov](https://www.linkedin.com/in/danilstoyanov/)\n\nDaniel is going to talk about his experience participating in a Contest for developers for implementing live streaming browsing feature. He will talk a little about which technologies for web streaming are most popular right now and will try to to combine them with his solution.\n\n**About Daniel:** \"Daniel has been in development professionally since 2017, he remembers the era when jQuery was a prominent tool and even recalls some flash elements in the browser. Not only does he enjoy being a frontend developer, but he also finds pleasure in exploring other fields within development. He particularly likes experimenting with backend technologies and indulging in pet projects related to video.\"\n\n**8:00 pm** - Networking  \n**9:00 pm** - Doors Close  \n(Note: All times in the schedule are an approximation.)  \n**Many thanks to [Super.com](http://Super.com) for hosting us!**\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nWe're looking for sponsors for events like these. If you or your company would like to support TorontoJS and get a message out to our community, please get in touch with \\[[organizers@torontojs.com](http://organizers@torontojs.com)\\]([mailto:organizers@torontojs.com](http://mailto:organizers@torontojs.com))\n\nThe [Code of Conduct](https://torontojs.com/p/code_of_conduct) is enforced at all TorontoJS events and spaces - online or in-person.\n\nGendered toilets and a single occupancy accessible toilet are available.  \nTorontoJS is a volunteer-led not-for-profit organization. Please help us with tidying up; otherwise, the venue staff and volunteers will have to pick up after you.\n\n**IMPORTANT:** Attendees must RSVP on Guild: [JS Tech Talk \\[In-Person\\] - CSS-Edit: Beyond Text Editing | Streaming & Coding Contests: A Digital Surge | Guild](https://guild.host/events/js-tech-talk-inperson-gj22iz)"
}
