{
	"title": "JS Tech Talk: January Edition",
	"hosts": [
		"dann",
		"Matthew M."
	],
	"startDate": "2019-01-28T18:00:00-05:00",
	"endDate": "2019-01-28T18:00:00-05:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nHappy 2019! We are excited to announce our next JS Tech Talk event night, and the first one of the year.\n\nSpecial thanks to LoyaltyOne ([https://www.loyalty.com/](https://www.loyalty.com/)) for providing the space and delicious food and refreshments!!\n\nAnd thanks to Blockstack ([https://blockstack.org/](https://blockstack.org/)) for sponsoring the AV.  \nA Blockstack Engineering Partner will introduce Blockstack - the easiest way to build decentralized blockchain apps. With Blockstack, developers can simply streamline their application code using Blockstack Auth and Storage Services. Developers don't have to worry about data liability since users provide their encrypted data. They manage their own identity across the entire ecosystem and store information in their provider of choice. After a successful pilot and alpha run the engineering partner will also introduce their App Mining Program - an incentive mechanism that allows small teams to bootstrap without advertising or venture capital. Each month, qualifying apps compete to be ranked by expert App Reviewers—the better their app is, the higher the payout they earn. Payouts are $100k in total each month.\n\n// TALKS\n\n1.  Amit Bronner - Machine Learning in Javascript\n\nJavascript is the most popular technology according to the last stackoverflow developer survey results. Machine learning is one of the important trends in the software industry today and tensorflow is the most loved framework, according to the same survey. Machine learning software is currently predominantly developed in python. Released in March 2018, [tensorflow.js](http://tensorflow.js) has opened up new possibilities for Javascript developers to build new models, use existing ones and innovate in new and exciting ways. This talk will review the state of machine learning software development in javascript and discuss its potential and limitations. Amit Bronner is a tech lead, architect and developer with 20 years of professional experience. Amit holds an MSc in AI and has experience with natural language processing, machine translation and information retrieval.\n\n2.  Andrew Louis - Building a Memex with Javascript\n\nIn 1945, the Memex was supposed to be the ultimate personal library. In addition to storing information, users could navigate, organize, link, and share data. When Andrew found out it was never built, he set about building a modern version in Javascript. Andrew created dozens of importers for different services, organized the 10M data points into a graph schema, and built an API and frontend in Javascript. Andrew will go over the history of the Memex, how he built his own, and do a demo of what can be done with it. Andrew is a software developer from Toronto. After learning about the Memex and finding out that it was never built in 1945, he decided to try to build one of his own. Previously, he was the co-founder and CTO of ShopLocket, an ecommerce startup acquired in 2014.\n\n// SCHEDULE\n\n6:00pm - Doors open. Grab something to eat and network with attendees.\n\n6:30pm - Opening announcements. News and information about the Toronto JavaScript community and upcoming events.\n\n6:50pm - 6:55pm - Blockstack - the easiest way to build decentralized blockchain apps.\n\n7:00pm - Amit Bronner - Machine Learning in Javascript\n\n7:35pm - Andrew Louis - Building a Memex with Javascript\n\n8:15pm - Lightning Talks\n\n8:15pm - 8:30pm - Deep Dhillon from LoyaltyOne to speak about “Hyperloop: Creating transportation of the future\n\n8:30pm - 8:45pm - Alex Wilmer speaking about \"Fishy, Sneaky, Sticky Cookies\"\n\n8:45pm - Goodbyes, give us a hand cleaning up the space, and post-event drinks at a local pub!\n\n// Note that the schedule is subject to change and accommodates 10-15  \n// minute breaks between sessions.\n\n// Interested in speaking or sponsoring?\n\n// Please email us at [team@torontojs.com](http://team@torontojs.com) for more information. All skill  \n// levels are welcome for talks!\n\n// Join us on Slack: [http://slack.torontojs.com/](http://slack.torontojs.com/)\n\n// Follow us on Twitter: [https://twitter.com/torontojs/](https://twitter.com/torontojs/)\n\n// See you there!"
}
