{
	"title": "March Tech Talk Night: Frameworks, Cryptography, and Quadcopters",
	"hosts": [
		"Taz S."
	],
	"startDate": "2013-03-14T18:00:00-04:00",
	"endDate": "2013-03-14T18:00:00-04:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nWe're pleased to announce another JavaScript Tech Talk Night. We have three great talks lined up for this event.\n\nWe'd like to thank our sponsors for covering the venue, A/V, pizza, and drink costs:\n\nMyplanet Digital ([http://www.myplanetdigital.com/](http://www.myplanetdigital.com/))\n\nMyplanet is a rapidly growing design & technology company specializing in the process and practice of envisioning, designing, and building digital products. Our expertise rests on three key pillars: lean user experience design, agile product development, and open source software.\n\nMyplanet is searching for an army of JavaScript developers with an interest in Backbone, Ember or AngularJS & a penchant for Nerf Gun battles.\n\nMake Web Not War ([http://www.webnotwar.ca/](http://www.webnotwar.ca/))\n\nMake Web Not War is a passionate community of tech enthusiasts. This group originally started as an event organized by Microsoft Canada and has grown into a diverse community of developers, technologists, business owners & students across Canada. Make Web Not War welcomes anyone who is excited about the latest trends in web, mobile, cloud and open data. Whether you like .Net, PHP, Python, Java, Ruby, use open source or commercial software (or both) Make Web Not War is about building technology solutions that work together.\n\nWe're also hosting a Windows 8 App Workshop with Make Web Not War. Check it out here: [https://www.atendy.com/event/microsoft-windows-8-workshop-1-8559](https://www.atendy.com/event/microsoft-windows-8-workshop-1-8559)\n\nBringing Sexy Back - Arvin Singla ([https://twitter.com/arvinsingla](https://twitter.com/arvinsingla))\n\nThe enterprise traditionally moves at glacial speeds when adopting new technologies. But they are not alone. Myplanet ([http://www.myplanetdigital.com/](http://www.myplanetdigital.com/)) has thrived on PHP development but needs to look towards the future to ensure it remains a sought after player for years to come. We are looking to push forward the use of sexy and exciting technologies in the enterprise space, and we'll show you how we're doing it.\n\nCryptography - Barry Steyn ([https://twitter.com/barrysteyn](https://twitter.com/barrysteyn))\n\nBarry will talk about cryptography in the browser via a JavaScript library. Firstly, Barry will give a brief definition of cryptography and explain three concepts: A block cipher, password key derivation and message authenticating codes. Then Barry will discuss the pros and cons of using a crypto JavaScript library in the browser. If one has to use such a library, then the Stanford JavaScript Crypto Libraray (SJCL) is the way to go, and so Barry will end this talk with a demo of that library covering the concepts that were introduced.\n\nQuadcopters - Joshua Kelly ([https://twitter.com/robofuture](https://twitter.com/robofuture)) and Tasveer Singh ([https://twitter.com/tazsingh](https://twitter.com/tazsingh))\n\nEver dream about building your own quadcopter? How about controlling it via JavaScript? Well, this is the talk for you. Joshua and Tasveer have been fiddling with JavaScript and hardware access. They'll be speaking on how they've managed to get JavaScript to power a quadcopter and the challenges along the way.\n\nTalk Proposals and Sponsoring\n\nIf you would like to give a talk or would like to sponsor an event, please contact Tasveer."
}
