{
	"title": "JS Hack Night",
	"hosts": [
		"dann"
	],
	"startDate": "2015-05-12T18:30:00-04:00",
	"endDate": "2015-05-12T18:30:00-04:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nHi everyone! For this JS Hack Night, we've partnered with Pearl Chen ([https://twitter.com/PearlChen](https://twitter.com/PearlChen)) and Ahmad Nassri ([https://twitter.com/AhmadNassri](https://twitter.com/AhmadNassri)) of YeomanTO ([http://yeoman.to/](http://yeoman.to/)) to bring you a super exciting event dedicated to front end task runners and automated build processes! The joint event will be in the main area, but there will be a separate space for those regulars who just want to hack on things. Event description follows:\n\n\\-------\n\nTask runners will make your developer life more productive by automating all the tedious tasks that you might currently do manually such as: compilation, minification, unit testing, etc. Popular task runners include Grunt or Gulp but there are more popping up. With all these options, how can you figure out which one is right for you?\n\nThat is why we are throwing away the PowerPoint slide decks for the night and only showing you real world usage. We'll have short show & tell demos of actual projects using everything from Grunt or Gulp to NPM scripts. See various ways these tools are used in production, how they set it up, and learn what the presenters struggled with and their solutions.\n\nOur show & tell presenters include:\n\nKate Hudson, @k88hudson ([https://twitter.com/k88hudson](https://twitter.com/k88hudson))\n\nKate Hudson is a web engineer from Toronto, Ontario. She is currently working for Mozilla on building applications for the greater good using nodejs, front-end javascript, and Android.\n\nKent English, @kentenglish ([https://twitter.com/kentenglish](https://twitter.com/kentenglish))\n\nKent is a senior developer at CrowdRiff. He has been working with Go and React a lot lately, and is inordinately fond of saskatoon pie and gifs.\n\nMark Appleby, @themarkappleby ([https://twitter.com/themarkappleby](https://twitter.com/themarkappleby))\n\nMark is a self-taught developer. Originally studying and working in the industry as a graphic designer, Mark now works at The Working Group as a front-end developer. In this role, he focuses his passion and experience in helping to bridge the gap between design and development. Mark has worked with a diverse range of clients, from startups to national organizations like The Boys and Girls Clubs of Canada, Sobeys, and Rogers.\n\nRobyn Larsen, @robyn\\_larsen ([https://twitter.com/robyn\\_larsen](https://twitter.com/robyn_larsen))\n\nFormer nuclear engineer now blurring the lines between work and play as a front end web developer, mentor and entrepreneur. Her tools of choice are HTML5, CSS3, Sass, responsive design, and JavaScript. She lives by challenging assumptions, improving process, and never settles. Now you can now find her working at Normative, Toronto based design firm that specializes in designing for the networked world.\n\nVlad Filippov, @vladikoff ([https://twitter.com/vladikoff](https://twitter.com/vladikoff))\n\nVlad Filippov is a software engineer working on cloud services at Mozilla. He is a contributor to various large and well-known open source projects, including Grunt and Firefox Accounts. He has also been deeply immersed in software development since last century. His work has roamed widely: from desktop web development (client and server), to mobile, Android and 3D games.\n\nAfter the demos, feel free to crack open your laptop and work on improving your own developer workflow. Whether this is your first task runner or you just want to try a new one, the presenters will stick around to point you in the right direction or just talk shop.\n\nDevelopers from all walks of life are encouraged to attend. This is an evening for both beginners, intermediates, and experts to learn from each other. Attendees must adhere to the Bento Miso Code of Conduct ([https://bentomiso.zendesk.com/hc/en-us/articles/201812303](https://bentomiso.zendesk.com/hc/en-us/articles/201812303))."
}
