{
	"title": "July Tech Talks - State Management Edition",
	"hosts": [
		"dann",
		"Matthew M."
	],
	"startDate": "2018-07-30T18:00:00-04:00",
	"endDate": "2018-07-30T18:00:00-04:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nThis month we have a special event you will not want to miss! We're focusing on State Management looking at it in JavaScript and how to leverage Microstates.\n\nOn top of this, we'll be having a Fireside Q&A afterwards with the speakers and special guests!\n\nWe would like to thank [Waffle.io](http://Waffle.io) for sponsoring food and beverages for the event. [Waffle.io](http://Waffle.io) is project management reimagined for developers, automatically updated by your GitHub issues, branches, and pull requests. [https://waffle.io/](https://waffle.io/)\n\nWe would also like to thank RBC for sponsoring AV and recording talks at the event. [http://www.rbc.com/futuremakers/](http://www.rbc.com/futuremakers/)\n\nThe venue is generously provided by Points. [https://www.points.com/dev/](https://www.points.com/dev/)\n\n// TALKS\n\n1.  Taras Mankovski - Composable state management with Microstates\n\nState management should easy. It’s difficult because complexity grows exponentially when you add state. In this presentation I will show how Microstates decreases complexity in state management by making state composable. Taras Mankovski is a Software Engineer at The Frontside and co-creator of Microstates [https://twitter.com/tarasm](https://twitter.com/tarasm)\n\n2.  Lightning talk: Tomek Maszkowski - Spreadsheet-like programming in JS with xcell\n\nProgramming calculations like insurance tariff or mortgage plan imperatively is a tedious and error-prone process. Their maintenance is even harder. Spreadsheets feel much better suited for it. This presentation will demonstrate how to use xcell for programming any kind of calculations declaratively - much like as we do them in spreadsheets. Tomek Maszkowski is an independent freelance full stack developer. [https://twitter.com/tomazy](https://twitter.com/tomazy)\n\n3.  Fireside Q&A chat with special guests Shane Keulen, Alex Wilmer, along side speaker Taras Mankoviski. Moderated by Dann Toliver. This is your moment to ask the panelists your deepest most thought-inspiring questions about their talks or the web development ecosystem in general. It's your time to spark a conversation with the panelists and also the audience to bring about a greater discussion that we can all benefit from.\n\nAlex Wilmer is a JavaScript enthusiast who has spent the last few years immersed in the React / NodeJS ecosystem and spends much of his free time contributing to open source projects and helping developers in various communities. He is currently the frontend team lead at Windscribe and part time lecturer at Lighthouse Labs\n\nShane Keulen is a Javascript developer at Influitive in Toronto with a passion for tooling and team efficiency.\n\n// SCHEDULE\n\n6:00pm - Doors open. Grab something to eat and network with attendees.\n\n6:30pm - Opening announcements. News and information about the Toronto JavaScript community and upcoming events.\n\n6:45pm - Taras Mankovski - Composable state management with Microstates\n\n7:45pm - Lightning talk: Tomek Maszkowski - Spreadsheet-like programming in JS with xcell\n\n8:00pm - Fireside Q&A chat\n\n8:30pm - Goodbyes, give us a hand cleaning up the space, and post-event drinks at a local pub!\n\n// Note that the schedule is subject to change and accommodates 10-15  \n// minute breaks between sessions.\n\n// Interested in speaking or sponsoring?\n\n// Please email us at [team@torontojs.com](http://team@torontojs.com) for more information. All skill  \n// levels are welcome for talks!\n\n// Join us on Slack: [http://slack.torontojs.com/](http://slack.torontojs.com/)\n\n// Follow us on Twitter: [http://slack.torontojs.com/](http://slack.torontojs.com/)\n\n// See you there!"
}
