{
	"title": "August Tech Talk Night",
	"hosts": [
		"Taz S."
	],
	"startDate": "2014-08-21T19:00:00-04:00",
	"endDate": "2014-08-21T19:00:00-04:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nEeeek it's been a while since we've seen all of your wonderful faces at Bento Miso ([https://bentomiso.com/](https://bentomiso.com/))! Join us for the August edition of our Tech Talk nights.\n\nFirst of all, we'd like to thank Top Hap for sponsoring the A/V for the event:\n\nTop Hat ([https://tophat.com/](https://tophat.com/)) is a mobile first learning platform designed to help educators make every lecture count. With over 400K students, 350+ schools and thousands of professors, Top Hat is changing the way students engage in and out of class. Founded in 2009 in Waterloo Top Hat has raised 20M in funding and of course... they are hiring amazing devs ;)\n\nWe have 2 tickets to give away for FITC ([http://fitc.ca/](http://fitc.ca/))'s upcoming Web Unleashed ([http://fitc.ca/event/webu14/](http://fitc.ca/event/webu14/)) event in September. Check out their website for more details and use code \"TorontoJS\" to receive a $50 discount!\n\n6:15pm - Doors Open. Grab a bite to eat and chat with other attendees.\n\n7pm - JavaScript Through The Ages - Tasveer Singh ([https://twitter.com/tazsingh](https://twitter.com/tazsingh))  \nThere are a million different ways to use JavaScript right now but which one is right for you? Tasveer will give a macro level overview of different front-end JavaScript application architectures to aide you in this decision. He will be reflecting on his experience as a JavaScript developer and lessons that he has learnt along the way.\n\nAbout Taz  \nTasveer is a software architect, CTO, and organizer of the Toronto JavaScript and Toronto Code Retreat groups. He is recognized for his work on highly concurrent web applications which, more recently, are backed by graph database technology and served via WebSocket. When he’s not tinkering with a computer, he can be found at the local race track or rock climbing gym.\n\n7:30pm - Making Accessible Web Components - Josh Kelly ([https://twitter.com/jdjkelly](https://twitter.com/jdjkelly))  \nAs JavaScript developers, we've got legal and ethical responsibilities to ensure that our web applications are accessible to assistive technologies like VoiceOver. Thankfully, with the ARIA standard we can build rich Web Components without sacrificing our responsibility to access. We'll cover what accessible markup looks like, and how to implement it in example Web Components driven by popular Javascript MVC frameworks.\n\nAbout Josh  \nJoshua Kelly ( [https://github.com/jdjkelly](https://github.com/jdjkelly) ) is a developer of applications that modify DOM fragments. He's been using JavaScript since DHTML was a buzzword people actually used. Lately, he's been working on front end apps and APIs at Uniiverse ([https://uniiverse.com](https://uniiverse.com)).\n\n8:15pm - Visualizing Persistent Data Structures - Dann Toliver ([https://twitter.com/dann](https://twitter.com/dann))  \nBasic persistent data structures like a linked list or sorted binary tree are easy enough to grasp from a single picture, but more complex structures are becoming increasingly important and widely used. Interactive animations can help us develop a deep intuition for how these complicated structures evolve over time, and can serve as a profiling tool to highlight inefficiencies in our data models.\n\nWe’ll look at some old chestnuts (red-black trees, queues, deques, finger trees) and some modern classics like persistent HAMTs and RRB-Trees. Along the way we’ll see that data structures come in many different flavors: partially, fully, or confluently persistent; catenable or not; amortized or not, and that they can also be categorized by general performance characteristics, query functionality, update functionality and more. We’ll examine the importance of those properties from a variety of use case perspectives, and see how using them can reduce complexity and make our JS programs easier to reason about.\n\nAbout Dann  \nCommunity rabble-rouser. Author of Daimio. Contract coder. Maker of things. Partner at Bento Box ([http://bentobox.net/](http://bentobox.net/)). Co-founder of Bento Miso. Likes math.\n\nSee you there!"
}
