{
	"title": "#TOTechBash 2014",
	"hosts": [
		"Taz S."
	],
	"startDate": "2014-12-02T20:00:00-05:00",
	"endDate": "2014-12-02T20:00:00-05:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nCelebrate another great year for Toronto’s leading-edge tech community December 2nd at 8pm at the Courthouse!\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nPlease visit [www.totechbash.com](http://www.totechbash.com) ([http://www.totechbash.com/](http://www.totechbash.com/)) or Indiegogo at [http://igg.me/at/TOTechBash2014](http://igg.me/at/TOTechBash2014) for more details and to purchase tickets.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nThis annual bash brings together developers, designers, creative technologists, makers, hackers, entrepreneurs and more from all the community groups, startups, organizations, companies, and local initiatives. Together lets raise a glass and salute a successful and innovative year of tech in the city!\n\nMix and mingle with 500 anticipated attendees from Toronto's tech community while enjoying:\n\n• The beautiful and historic Courthouse in downtown Toronto  \n• Installations from local makers and creative technologists  \n• Tech giveaways to be won  \n• Live DJ and dance floor  \n• TOTech Top Contributor nominees honoured and winner announced  \n• Ticket includes 1 drink and 1 raffle ticket + cash bar  \n• Endless opportunities to connect and network  \n• This is a 19+ event\n\nLast year at #TOTechWrap we raised close to $3000 for the Daily Bread Food Bank providing food for 480 people. Wow! This year #TOTechBash will help change healthcare through technology by supporting Not Impossible Labs. Widely known for the creation of The EyeWriter, Mick Ebeling and his team of makers and hackers are helping many by helping individuals, and providing low-cost solutions on an open source, DIY platform. What a great way for our Toronto community to contribute globally to improving the lives of others with technology.\n\nA new addition to this year's event is the TOTech Top Contributor Honour. ([http://totechbash.com/#nomination\\_details](http://totechbash.com/#nomination_details)) The top ten nominees will be posted on blogTO for the city and community to vote! The winner will be announced December 2nd at the event. This is a great opportunity to recognize amazing members of Toronto's tech scene.\n\nJoin the Indiegogo campaign and grab yourself a ticket to this special event! Regular tickets are just $20 and include a drink and a raffle ticket for some great prizes. For more details and to purchase a ticket please visit [www.totechbash.com](http://www.totechbash.com) ([http://www.totechbash.com/](http://www.totechbash.com/)) and [http://igg.me/at/totechbash2014](http://igg.me/at/totechbash2014)"
}
