{
	"title": "JS Tech Talk: 20 Years as a Self Taught Developer",
	"hosts": [
		"Matthew M.",
		"2 others"
	],
	"startDate": "2022-04-05T18:00:00-04:00",
	"endDate": "2022-04-05T18:00:00-04:00",
	"status": "active",
	"locationType": "virtual",
	"image": null,
	"tags": [
		"Events in",
		"JavaScript",
		"JavaScript Applications",
		"JavaScript Frameworks",
		"JavaScript Libraries",
		"Web Technology"
	],
	"details": "Details\n-------\n\nWe're BACK! JS Tech Talk is for sharing knowledge about all things Javascript or dev-related to improve our craft and careers. This talk is open to all skill levels.\n\nFor this talk, Adam Winick will reflect on some challenging moments and learning opportunities that he has experienced as a self taught developer–highlighting concerns that developers of all levels have shared with Adam over his career. This talk is what he would say to guide his newbie, green, junior developer self over the past 20 years.\n\nTopics will include struggles with:\n\n*   Imposter syndrome: Dissecting the cycle and feeling of being an imposter, past and present.\n*   Growth path: From Dreamweaver, Flash and Photoshop to writing full stack applications for multiple platforms and stacks. From junior dev to team lead.\n*   Building a career while managing mental and emotional health issues.\n*   Finding peace in a chaotic space.\n\nIn sharing these stories and learnings, Adam hopes that developers from all paths will reflect and incorporate some of these learnings to find happiness, direction and fulfillment in their careers.\n\nSchedule\n\n6:00 event start\n\n6:15 Talk begins\n\n6:45 Q&A\n\n7:00 - End: General social chatter.\n\nCode of conduct is enforced at all TorontoJS events [https://torontojs.com/p/code\\_of\\_conduct](https://torontojs.com/p/code_of_conduct)\n\nSpeaker Bio:  \nAdam Winick is a Senior Developer and Dev Lead at Loblaw Digital with 20 years of experience in web and app development. When he’s not coding, he’s producing electronic music, mentoring newer devs, and being the coolest dad to his 9 year old daughter.\n\nLoblaw Digital brings digital experiences to life.  \n[https://loblawdigital.co/](https://loblawdigital.co/)\n-----------------------------------------------------------------------------------------------------------\n\nWanna give a talk or workshop? Tell us about it at [https://tinyurl.com/torontoJS](https://tinyurl.com/torontoJS) or email organizers at torontojs dot com"
}
