{
  "title": "(Typescript with React) && (Migrating from Angular to React/Redux)",
  "hosts": [],
  "startDate": "2019-04-17T18:00:00-04:00",
  "endDate": "2019-04-17T18:00:00-04:00",
  "status": "active",
  "locationType": "in-person",
  "image": null,
  "tags": [
    "Events in Toronto, ON"
  ],
  "details": "Details\n-------\n\nIt's tech talk time again and this time it's spring so we're less likely to have a huge snowstorm (like the last one!).\n\nWe would like to thank LoyaltyOne ([https://www.loyalty.com/](https://www.loyalty.com/)) for providing the location and sponsoring food and beverages for the event.\n\n// TALKS\n\n1.  Arsene Toumani - How We Migrated from Angular to React/Redux\n\nWhen I first built the MVP of our FinTech SaaS platform back in 2017, I decided to use AngularJS. This decision was made with the understanding that we would later migrate to a newer Javascript framework. In 2019, we progressively migrated over to React/Redux, resulting in 3x faster load times. During this talk I'll explore why we decided to migrate, why we chose React/Redux and how we made it happen.\n\nArsene is a technology leader who’s passionate about building skilled agile teams and shipping high quality software. He’s lead and mentored large engineering teams to build highly scalable and secure SaaS applications for some of Canada's largest brands like Manulife, Sun Life, Pizza Pizza, and Air Miles. His personal mission is to positively impact and inspire billions of people in his lifetime. - [https://twitter.com/ArseneToumani](https://twitter.com/ArseneToumani)\n\n2.  Nicole Chung - Typescript with React - It doesn't have to be this way!\n\nIs it worth building a React project with Typescript? Does Typescript add extra complexity? Do you have to start programming in an object-oriented way? Does Typescript force you to use classes? Will you have to integrate a bunch of different design patterns? Can you integrate Typescript in a project that needs Babel plugins to work? Are there any good guides for React and Typescript? These questions can discourage a developer from looking into Typescript.\n\nWell, here is some news - it doesn't have to be this way! Typescript with React has come a long way in the last two years. Now you can get a Typescript project up and running with Create React App! And you can still use the same functional style you prefer - with the goodness of static typing. (This talk will show you the actual benefits of static typing.)\n\nNicole Chung is a Senior Engineer at League, and a former tech lead at TWG. - [https://twitter.com/redconservatory](https://twitter.com/redconservatory)\n\n// SCHEDULE\n\n6:00pm - Doors open. Grab something to eat and network with attendees.\n\n6:30pm - Opening announcements. News and information about the Toronto JavaScript community and upcoming events.\n\n6:45pm - Arsene Toumani - How We Migrated from Angular to React/Redux\n\n7:45pm - Nicole Chung - Typescript with React - It doesn't have to be this way!\n\n8:30pm - Goodbyes and clean-up\n\n// Note that the schedule is subject to change and accommodates short  \n// breaks between sessions.\n\n// Interested in speaking or sponsoring?\n\n// Please email us at [team@torontojs.com](http://team@torontojs.com) for more information. All skill  \n// levels are welcome for talks!\n\n// Join us on Slack: [http://slack.torontojs.com/](http://slack.torontojs.com/)\n\n// Follow us on Twitter: [https://twitter.com/torontojs](https://twitter.com/torontojs)\n\n// See you there!"
}