{
  "title": "JS Tech Talk [In-Person]: Simplify Complex Apps, Nx, Apollo Cache(RSVP on Guild)",
  "hosts": [
    "sami x."
  ],
  "startDate": "2023-12-06T18:00:00-05:00",
  "endDate": "2023-12-06T18:00:00-05:00",
  "status": "active",
  "locationType": "in-person",
  "image": "https://secure.meetupstatic.com/photos/event/a/3/3/1/600_510821777.webp?w=750",
  "tags": [
    "Events in Toronto, ON",
    "JavaScript",
    "JavaScript Applications",
    "JavaScript Frameworks",
    "JavaScript Libraries",
    "Web Technology"
  ],
  "details": "Details\n-------\n\n\\# 🙌 We’re back again one last time this year with another evening of tech talks for December!\n\n👋 Come out and join us for a special event with some of our longest members who are coming together to share their knowledge with the community.\n\n**🎟️** **RSVP at the link below** while there are spots available to avoid being on the waitlist: [JS Tech Talk \\[In-Person\\]: Simplify Complex Apps, React and React native Code Share, Apollo Caching | Guild](https://guild.host/events/js-tech-talk-inperson-wku7de)\n\n\\## **Schedule:**\n\n**6:00 pm** - Doors Open  \n**6:20 pm** - Welcome notes from TorontoJS  \n**6:30 pm** - Welcome from our hosts - Super.com  \n**6:35 pm** - **How to build complex apps without frameworks**  \n**Paul Gordon** is a serial tech entrepreneur with a ton of experience working in the weeds on some of the hardest research problems the industry has to offer (real-time production-grade compilers), as well as in the clouds and leading, training, and managing teams of developers at all skill levels and plotting long-term visions.\n\nHe is going to show how he builds apps without frameworks. He'll be demoing an open-source app he is working on that uses the techniques. And he'll explain why and when you might want to do this.\n\n**7:05 pm** - **Share Code Between React and React Native**  \n**Emily Xiong** is a front-end developer who likes hiking, biking, and running. I am going to do a full marathon next year. I am currently working for an open-source company called Nx. I previously worked for enterprises and consulting firms in Toronto.\n\nEmily will explain why usually creating web and mobile apps requires totally different tech stacks, and it is pretty hard to share code. This presentation shows how she adds a React web app and a React Native mobile app, and how she optimizes codeshare between the two.\n\n**7:35 pm** - 15 mins break  \n**7:50 pm** - **Apollo caching and how to befriend it**  \n**Raman Lally** is a software developer with a passion for solving complex problems, mastering technology, and applying himself in everything that he does. His experience includes large-scale React projects with GraphQL servers and microservices. He's involved in all aspects of the stack, from GraphQL servers to React components. Currently, he's pioneering a GraphQL solution at his organization.\n\nHe will give us an inside look at how the cache works in Apollo client and what it is doing behind the scenes (normalization, automatic updates, and garbage collection).\n\n**8:20 pm** - Networking  \n**9:00 pm** - Doors Close\n\nNote: All times in the schedule are an approximation.\n\n**Many thanks to [Super.com](http://Super.com) for hosting us!**  \nWe're looking for sponsors for for events like these. If you or your company would like to support TorontoJS and get a message out to our community, please get in touch with \\[[organizers@torontojs.com](http://organizers@torontojs.com)\\]([mailto:organizers@torontojs.com](http://mailto:organizers@torontojs.com))  \n[Code of Conduct](https://torontojs.com/p/code_of_conduct) is enforced at all TorontoJS events and spaces-online or in-person.\n\nGendered toilets and a single occupancy accessible toilet are available.\n\nTorontoJS is a volunteer-led not-for-profit organization. Kindly assist us with tidying up, as otherwise the venue staff and volunteers have to pick up after you.\n\nRSVP AT [JS Tech Talk \\[In-Person\\]: Simplify Complex Apps, React and React native Code Share, Apollo Caching | Guild](https://guild.host/events/js-tech-talk-inperson-wku7de)"
}