{
	"title": "May Tech Talk and Rise of the Transpilers Panel",
	"hosts": [
		"Taz S."
	],
	"startDate": "2015-05-21T18:30:00-04:00",
	"endDate": "2015-05-21T18:30:00-04:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nIt looks like our last Tech Talk Night managed to warm up the city and you can all thank us for the awesome weather that we've been having! We have another hot event lined up for you this month with a JSConf speaker and a panel of JavaScript experts.\n\nWe would like to thank Lighthouse Labs for sponsoring the event:  \nLighthouse Labs ([https://lighthouselabs.ca/](https://lighthouselabs.ca/)) has reimagined the developer bootcamp. After spending the last 1.5 years perfecting our groundbreaking program in Vancouver, we are launching right here in Toronto! It's about more than just learning to code: it's about becoming a developer. We've built our 8-week curriculum to hold students to a high standard of professional development while constantly iterating on that curriculum to keep it cutting-edge. We also believe development isn't always learned behind a computer. That's why Lighthouse Labs is teaching out of HIGHLINE, Toronto's most dynamic tech hub, and is keeping class sizes small while employing 40+ senior developers as mentors and TAs.\n\nIf you're an experienced web (JS, Ruby, Python, or the like) or iOS (Objective-C... not just Swift!) developer who enjoys mentoring junior developers then you should really look into mentoring / teaching at Lighthouse Labs! This is the perfect part-time gig, with scheduling flexible enough for developers at startups and larger companies, as well as freelancers. Minimum commitment is 5 hours a week but some of our teachers scale up to 20/week. Contact Khurram ( [khurram@lighthouselabs.ca](http://khurram@lighthouselabs.ca) ) to start a conversation!\n\n6:30pm - Doors Open. Grab a bite to eat, a drink, and network with other attendees.\n\n7:00pm - Opening Announcements. Usually involves information about TorontoJS, upcoming community events, discount codes, and ticket giveaways (if applicable).\n\n7:10pm - Visualizing Process Evolution - Dann Toliver ([https://twitter.com/dann](https://twitter.com/dann))  \nWhat actually happens when your code is run? Our programs are simple text documents composed of patterns of rules, but the processes they guide aren't nearly as well behaved. Function scopes are generated, data is plumbed through pathways, bits are shifted and applications are evaluated. There's a lot of ins, a lot of outs. It's a very complicated case.\n\nWe can gain some insight into the process with [console.log](http://console.log) and step-through debuggers, but we're left to develop a full program simulation in our minds based only on the code we wrote and the tiny snapshots our debugger gives us -- effectively requiring a JS interpreter to be compiled into our wetware. This can make it somewhat challenging to reason about our work.\n\nWe'll look at some ways of remedying this, starting with basic data structures and tiptoeing toward full programs. Your code is the DNA for a process: let's build an illustrated anatomy guide.\n\nAbout Dann  \nDann enjoys building things, like programming languages, databases, distributed systems, communities of smart friendly humans, and pony castles with his two year old.\n\n8pm - Rise of the Transpilers Panel  \nWith the ever growing popularity of compile to JavaScript languages, what should JavaScript developers be aware of? How can we best leverage these languages? What do these languages have to offer among one another? How do language feature such as types in TypeScript and compile targets such as [asm.js](http://asm.js) affect these languages?\n\nWe've invited three industry experts to speak on this topic which will be moderated by our organizer Tasveer Singh:\n\nKannan Vijayan ([https://twitter.com/kannan\\_vijayan](https://twitter.com/kannan_vijayan))  \nKannan has been a developer on Mozilla's Javascript team for 3 years. He has contributed to the IonMonkey optimizing JIT compiler. Kannan also worked with Jan de Mooij to design and implement the Baseline JIT compiler in SpiderMonkey.\n\nKannan is particularly interested in using JS engines as a target platform for the design and implementation of efficient VMs for languages with different semantics (e.g. Java, Python, Ruby).\n\nYuri Takhteyev ([https://twitter.com/qaramazov](https://twitter.com/qaramazov))  \nYuri is the CTO of [rangle.io](http://rangle.io)’s, a JavaScript consultancy based out of Toronto. He is a former faculty member at the University of Toronto and a published author. Yuri holds a M.S. in Computer Science from Stanford University and a Ph.D. in Information Management and Systems from from the University of California, Berkeley.\n\nRich Gilbank ([https://twitter.com/richgilbank](https://twitter.com/richgilbank))  \nRich is a front end developer at Shopify, where he writes Ruby and CoffeeScript for some large-scale applications. In his free time, he works on open source projects such as Scratch JS, helps run JavaScript meetups and events, and is a contributor to the HTML5 Boilerplate organization.\n\nDo you have a question for our panelists? Something that you've been curious about relating to JavaScript transpilation? Tweet your questions to @torontojs ([https://twitter.com/torontojs](https://twitter.com/torontojs)) or email them to [taz@torontojs.com](http://taz@torontojs.com) .\n\nIf you'd like to speak or sponsor one of our events, please email [taz@torontojs.com.](http://taz@torontojs.com.)\n\nSee you there!"
}
