{
  "title": "Women in Tech Summer Picnic in the Park!",
  "hosts": [
    "Elizabeth M."
  ],
  "startDate": "2024-08-11T14:30:00-04:00",
  "endDate": "2024-08-11T14:30:00-04:00",
  "status": "canceled",
  "locationType": "in-person",
  "image": "./images/600_522350891.webp",
  "tags": [
    "Events in Toronto, ON",
    "UX Design",
    "Women's Networking",
    "JavaScript",
    "Software Development",
    "Women in Technology"
  ],
  "details": "Details\n-------\n\n**TorontoJS is starting a new, permanent Women in Tech program and series of events!**  \n**Come out to Oriel Park beside Davisville TTC** **Station for a fun, relaxed social picnic in the park!**\n\nEveryone in tech or considering a career change is welcome. Please feel free to bring a guest or two.\n\nIf you're a crafter please feel free to bring a project. The host will be bringing her knitting (it's binary code after all ;-) )\n\n_**More details (including the snacks/dessert menu) coming soon.**_\n\n\\*\\*\\*\n\nTorontoJS is a safe space.  \nThe [code of conduct](https://torontojs.com/code_of_conduct) applies to this event and all other ones.  \n**We welcome and encourage people who are disabled, neurodivergent, deaf/Deaf, LGBTQ2S+, and BIPOC, to attend events, get involved as members and to volunteer!**\n\nThis event is open to women, binary and non-gender people, and trans-women.\n\n_**Under no circumstances should anyone ever touch a mobility aid (e.g. mobility cane, crutches, or wheelchair) or distract a service dog!**_  \nTreat mobility aids as extensions of a person - even when the person isn't currently using their mobility aid. If you need a mobility aid moved, ask the person it belongs to.\n\n**Transportation**\n\n*   Transit: 2-5 minute walk from Davisville TTC station\n*   Cycling: On multiple bike routes with a Toronto Bike Share station in the park\n*   WheelTrans: ask to be dropped off at 25 Frobisher Ave\n*   Parking: There is some free parking on the residential streets to the north. Please be respectful and check the parking signs.\n\n**Accessibility:**\n\n*   Davisville station is wheelchair accessible.\n*   It's a fairly level roll to the park.\n*   Oriel park has large accessible washrooms.\n*   WheelTrans - multiple spots for drop off.\n\n**Connect With TorontoJS**\n\n*   Find us online: [https://torontojs.com](https://torontojs.com)\n*   [Join us on Slack!](https://join.slack.com/t/torontojs/shared_invite/zt-zgi31snl-omO3tXSZ0Q7zqN9WBQSf8Q)\n*   You can also find TorontoJS events on [Guild.host:](http://Guild.host:) [https://guild.host/torontojs/events](https://guild.host/torontojs/events)\n\n\\*\\*\\*\n\n**Alt text for cover image:**  \ntext “Women in Tech Summer Picnic! Sunday, August 11  \n2:30pm to 6:30pm  \nOriel Park”  \nDesign: Photo of a green park with big leafy green trees on a sunny day. A picnic table is in the middle of the photo. Text is white on a semi-transparent black background. Next to the \"Women in Tech Summer Picnic\" text is an icon of two people with a plus sign. Lower right corner has the TorontoJS logo. Red background with a grey stylized CN Tower. The letters JS are in white."
}
