{
	"title": "October Tech Talk Night - ES6, Mithril.js, and Flux+React",
	"hosts": [
		"dann",
		"Taz S."
	],
	"startDate": "2014-10-23T18:00:00-04:00",
	"endDate": "2014-10-23T18:00:00-04:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nOctober, the month where the leaves change colour and you get to grab your favourite sweater before walking out the door. Also, the month for another Toronto JavaScript Tech Talk Night!\n\nWe'd like to thank HoodQ for sponsoring the event:  \nHoodQuotient ([http://beta.hoodq.com/](http://beta.hoodq.com/)) (or HoodQ for short) has aggregated and curated all of the geospatial data across North America over the past 1.5 years. More recently, they've have built industry specific products on top of this data which enables users to quickly quantify neighbourhood information. They like to use tools such as [React.js](http://React.js) with a Flux architecture for a highly interactive user experience coupled to a comprehensive RESTful JSON API. HoodQ is currently looking for JavaScript, Ruby ([http://www.techvibes.com/job/web-developer-15](http://www.techvibes.com/job/web-developer-15)), and DevOps ([http://www.techvibes.com/job/devops-engineer](http://www.techvibes.com/job/devops-engineer)) engineers to join their rapidly growing team. You can email them at [careers@hoodq.com](http://careers@hoodq.com)\n\n6:00pm - Doors open. Grab a bite to eat and chat with other attendees.\n\n6:30pm - New Shiny in ES6 - Marcos Caceres ([https://twitter.com/marcosc](https://twitter.com/marcosc))  \nThis talk aims to give an overview of the new syntax, operators, and primitives in ES6. Marcos will look at some of the new syntax, such as the fat arrow and new ways that simplify looping over collections. He will cover new object primitives (sets and maps), as well as promises: what they are and how you can use them to write cleaner, more comprehensible and maintainable async code. Marcos will also cover generators, and how they can help you encapsulate and simplify common coding patterns.\n\nAbout Marcos  \nMarcos works for Mozilla designing and standardizing next generation features for the Web through the W3C and WHATWG. Recent projects include HTML’s element, the Orientation Lock API, and a new JSON-based manifest format to enable web applications to become installable. Marcos has been developing for the web since 1996.\n\n7:20pm - [Mithril.js](http://Mithril.js) - Leo Horie ([https://twitter.com/LeoHorie](https://twitter.com/LeoHorie))\n\nThis talk will explore some of the concepts behind [Mithril.js](http://Mithril.js), a new JavaScript MVC framework designed from the ground up to be simple and fast. Leo will talk about designing discoverable systems, simplifying complexity through isomorphisms and how all those fancy buzzwords tie back to day-to-day work.\n\nAbout Leo  \nLeo works at Klick Health, building tools to help people make sense out of data. He's obsessed with the pursuit of systematic simplicity, and when he's not juggling two babies, he moonlights as the lead developer for the [Mithril.js](http://Mithril.js) project.\n\n8:10pm - Flux+React in Practice - Tasveer Singh ([https://twitter.com/tazsingh](https://twitter.com/tazsingh))  \nWhile Flux+React are the new kids on the block, the concepts that they employ aren't anything new. However it's just different enough that you have to think about modelling your front-end architecture in a different way. Tasveer will be speaking on his experience with Flux+React, having come from a background of building large front-end applications using MV\\* architectures. He may also cover some of his experimental concepts involving React on the server side to achieve isomorphic JavaScript.\n\nAbout Taz  \nTasveer is a software architect, CTO, and organizer of Toronto JavaScript. He is recognized for his work on highly concurrent web applications which, more recently, are backed by graph database technology and served via WebSocket. When he’s not tinkering with a computer, he can be found at the local race track or rock climbing gym.\n\nSponsoring & Speaking  \nIf you're interested in sponsoring an event or speaking at one, please email [taz@torontojs.com](http://taz@torontojs.com)\n\nSee you there!"
}
