{
	"title": "March Tech Talk Night - Distributed Computing, WebPack, and Angular 2.0",
	"hosts": [
		"dann",
		"Taz S."
	],
	"startDate": "2015-03-12T18:00:00-04:00",
	"endDate": "2015-03-12T18:00:00-04:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nDid you know that this February was the first February since 1967 where every day was below zero degrees? The reason is that we didn't warm up the hearts of Toronto with a Tech Talk Night! Join us on March 12th at Shopify's beautiful Toronto office for another spectacular event.\n\nWe would like to thank Lighthouse Labs for sponsoring the event:  \nLighthouse Labs ([https://lighthouselabs.ca/](https://lighthouselabs.ca/)) has reimagined the developer bootcamp. After spending the last 1.5 years perfecting our groundbreaking program in Vancouver, we are launching right here in Toronto! It's about more than just learning to code: it's about becoming a developer. We've built our 8-week curriculum to hold students to a high standard of professional development while constantly iterating on that curriculum to keep it cutting-edge. We also believe development isn't always learned behind a computer. That's why Lighthouse Labs is teaching out of HIGHLINE ([http://highline.vc/](http://highline.vc/)), Toronto's most dynamic tech hub, and is keeping class sizes small while employing 40+ senior developers as mentors and TAs.\n\nWant to mentor at Lighthouse Labs TO? This is the perfect part-time gig, with scheduling flexible enough for developers at startups and larger companies, as well as freelancers. Minimum commitment is 5 hours a week but some of our teachers scale up to 20/week. Contact [khurram@lighthouselabs.ca](http://khurram@lighthouselabs.ca) to start a conversation!\n\n6:00pm - Doors Open. Grab a bite to eat, a drink, and/or a beer courtesy of Shopify and network with other attendees.\n\n6:30pm - Opening Announcements. Usually involves information about TorontoJS, upcoming community events, discount codes, and ticket giveaways.\n\n6:35pm - Why Would We Ever Build a Distributed Computing Platform in Node? - Gord Tanner ([https://twitter.com/gordtanner](https://twitter.com/gordtanner))  \nbitHound is a JavaScript shop. They have been working with JavaScript for a few years and have a definite appreciation for the power and speed of which we can build in nodeJS. When they set out to start building bitHound, they made sure that they were able to use it to analyze itself to hone the tools.\n\nJavaScript is a great language but doesn't come without it's challenges. They will cover the good the bad and the ugly on our path to developing our distributed computing platform.\n\nAbout Gord  \nGord Tanner brings over 10 years of experience in software development and big data analytics. Before bitHound, Gord was a part of tinyHippos (acquired by BlackBerry in 2011) as well as a core contributor to the Ripple Emulator– donated to the Apache Foundation and used today by Microsoft, Intel, Adobe and over 250K developers. Gord is now co-founder and CTO at bitHound, a software analytics solution, helping JavaScript developers build remarkable, resilient software projects.\n\n7:30pm - WebPack - Tasveer Singh ([https://twitter.com/tazsingh](https://twitter.com/tazsingh))  \nAh JavaScript build tools. Love them or hate them, either way you have to use them. So what's the latest in the build tool landscape? And how does that tool approach the problems of modern day JavaScript applications while still providing developer happiness? Tasveer will speak about his experience using the WebPack build tool on a JavaScript application while highlighting its benefits and stumbling blocks along the way.\n\nAbout Tasveer  \nTasveer is a software architect, CTO of HoodQ, and organizer of Toronto JavaScript. He is recognized for his work on highly concurrent web applications which are backed by graph database technology and served via WebSocket. When he’s not tinkering with a computer, he can be found at the local race track or rock climbing gym.\n\n8:30pm - Angular 2.0 Demo and Q&A - Matias Niemelä ([http://twitter.com/yearofmoo](http://twitter.com/yearofmoo))  \nAngular 2.0 hasn't been released yet but have you wondered what's next for Angular? Matias of the Angular core team will be demonstrating the next major Angular release with an extended Q&A session afterwards.\n\nAbout Matias  \nMatias Niemelä is a core developer on the AngularJS project, working primarily on animations, tutorials and documentation as well as core-level contributions. While not working on AngularJS, Matias raises the bar on tech blogging via his website [yearofmoo.com](http://yearofmoo.com) ([http://www.yearofmoo.com/](http://www.yearofmoo.com/)). He also performs speaking engagements, attends meetups and hosts pair programming tutoring sessions. He lives in Toronto and has over 10 years of solid full-stack web development experience.\n\nNote that the above times are approximations and are subject to change.\n\nSponsoring & Speaking  \nIf you're interested in sponsoring an event or speaking at one, please email [taz@torontojs.com](http://taz@torontojs.com)\n\nSee you there!"
}
