{
	"title": "JS Tech Talk [ONLINE] Things I wish I knew for my first software job",
	"hosts": [
		"Ken B."
	],
	"startDate": "2024-06-27T18:00:00-04:00",
	"endDate": "2024-06-27T18:00:00-04:00",
	"status": "active",
	"locationType": "virtual",
	"image": "./images/600_521861070.webp",
	"tags": [
		"Events in",
		"JavaScript",
		"Software Development",
		"Web Development"
	],
	"details": "Details\n-------\n\n🙌 **TorontoJS Tech Talks are Back Online! again! What I wish I knew for my first software job!**  \nWe're thrilled to announce the return of TorontoJS Tech Talks to the virtual stage! This session, we're diving into the topic of what we wished we'd known for our first software job!\n\n👋 **Meet Our Special Guest,**  \nAbdul grew up in Toronto and currently lives in Taiwan. He loves to travel, learn about new technologies, and is passionate about the web and teaching. He started programming with Free Code Camp & CS50 and he’s been tinkering since. Abdul has experience working as a front-end software engineer in a startup environment and in leadership roles as a teacher. He enjoys learning about software architecture, spending time customizing his editor (vim), and the occasional leet code-ing.  \nLastly, Abdul is excited to teach and help others who are entering the field by sharing some of the lessons that his experience and mentors have imparted to him.\n\n**Schedule:**  \n**6:00 pm**\\- Warm welcome and introduction by TorontoJS  \n**6:10 pm** - Presentation by Abdhul Shabbir  \n**6:35 pm** - Interactive Q&A Session  \n**7:00 pm** - Networking Opportunity  \n**7:20 PM** - Closing Remarks\n\nThis event will unfold on Zoom, bringing together minds from everywhere in an inspiring virtual space.  \nInterested in speaking or sponsoring? Let's connect at sponsor\\[[@torontojs.com](http://@torontojs.com)\\]([mailto:organizers@torontojs.com](http://mailto:organizers@torontojs.com)).\n\nTorontoJS is committed to creating a safe and inclusive environment for all. Our Code of Conduct applies both online and in person at all our events and spaces.\n\nSee you there!"
}
