{
	"title": "UXUI Design Online Talk: Design Systems - A Survival Guide",
	"hosts": [
		"Elizabeth M.",
		"Marco C."
	],
	"startDate": "2024-10-02T18:00:00-04:00",
	"endDate": "2024-10-02T18:00:00-04:00",
	"status": "active",
	"locationType": "virtual",
	"image": "./images/600_523717282.webp",
	"tags": [
		"Events in",
		"Graphic Design",
		"UI Design",
		"UI/UX Design",
		"Web Design",
		"Front-end Development"
	],
	"details": "Details\n-------\n\n**This is our first UIUX Design event run by the new TorontoJS design team!**\n\n*   Would you like to advance your career and improve your UIUX Design and Frontend skills?\n*   Are you a graphic designer who wants to improve your UI design skills?\n*   Are you a frontend developer that wants to improve your design and Figma skills?\n*   Would you like to be part of a tech meetup community where developers listen to and value designers?\n\n**Well then this is the series for you!**  \nThe UIUX Design Series is designed for designers and frontend developers and run by the TorontoJS Design Team.  \n**Location: Online**  \n**Topic: Design Systems**  \n**Agenda**  \n**1 - What is NOT a Design System?**  \n“False Tracks: Misleading Signs in the Wild”  \nFocus on common misconceptions and what design systems are not.  \n**2 - What is a Design System?**  \n“Defining the Species: Identifying a True Design System”  \nExplore the fundamental characteristics of a design system.  \n**3-Design Systems as Product**  \n“The Ecosystem: Living and Breathing as a Product”  \nDiscuss viewing the design system as a product with its own lifecycle.  \n**4 - Challenges: Survival in the Wilderness**\n\n*   Concept: Planting the Seeds\n*   ⁠Raise: Nurturing Growth\n*   ⁠Adopt: Finding Allies and Surviving\n*   Scale: Thriving or Failing to Adapt\n\n**5-Wrap Up**  \n“Survival Lessons: What We’ve Learned from the Wild”  \nRecap the key takeaways that help design systems endure.  \n**6-Q&A**  \n“Campfire Stories: Sharing  \n**Speaker: Victor Montalvão**  \nVictor Montalvao is a seasoned design leader with over 15 years of experience shaping digital products and user experiences. As Senior Group Design Manager at SmartRecruiters, Victor led the design discipline across the Platform groups, as well as the Design System and Accessibility Program. With experience at companies such as Philips, Globo, Oi and Xello, he combines strategic vision with practical experience. Victor is passionate about transforming complex challenges into intuitive solutions and driving innovation through design.\n\n**Accessibility of** **UIUX** **Design Talk & Workshop Series**:  \n(Because accessibility isn't just about users!)\n\n*   All in-person events will be wheelchair accessible and have easy access to an accessible subway station or streetcar route.\n*   Online events will have auto captioning enabled and presenters/hosts will do our best to provide described audio of visuals.\n*   Talks uploaded to YouTube will have both captions and transcripts (_Please note: It may take a while for the first few YouTube videos to have captions and transcripts as we are setting up the new accessibility team. We're looking for volunteers!_)\n\n\\*\\*\\*  \n**About TorontoJS:** ℹ️  \n**Did you know that our members and volunteers are not just in Toronto, and that we're not just JavaScript!** We welcome people from any field in tech and with any level of skills - from students and those considering a career change up to seasoned professionals with decades of experience.  \nTorontoJS is dedicated to providing a welcoming, safe, inclusive and supportive environment for all regardless of their gender, sexual orientation, disability, physical appearance, body size, race, or religion.  \nPlease read the [code of conduct](https://torontojs.com/code_of_conduct) prior to attending this meeting. We welcome and encourage people who are disabled, neurodivergent, deaf/Deaf, LGBTQ2S+, and BIPOC, to attend events, get involved as members and to volunteer!  \n\\*\\*\\*  \n**Connect With TorontoJS 🔗**\n\n*   Website: [https://torontojs.com](https://torontojs.com)\n*   [Join us on Slack!](https://join.slack.com/t/torontojs/shared_invite/zt-zgi31snl-omO3tXSZ0Q7zqN9WBQSf8Q)\n*   Follow us on LinkedIn: [https://www.linkedin.com/company/torontojs/](https://www.linkedin.com/company/torontojs/)\n*   You can also find TorontoJS events on [Guild.host:](http://Guild.host:) [https://guild.host/torontojs/events](https://guild.host/torontojs/events)\n\n\\*\\*\\*  \n**Alt text for cover image:**  \nToronto JS Logo, Design Talk Online  \nHeader that reads: \"Design Systems: A Survival Guide\"  \nText below header: \"Victor Montalvao is a seasoned design leader with over 15 years of experience shaping digital products and user experiences. As Senior Group Design Manager at SmartRecruiters, Victor led the design discipline across the Platform groups, as well as the Design System and Accessibility Program. With experience at companies such as Philips, Globo, Oi and Xello, he combines strategic vision with practical experience. Victor is passionate about transforming complex challenges into intuitive solutions and driving innovation through design.\"\n\nBelow it reeds: Date and Time: October 2, 2024 6:00 PM\n\nOn the right side there is a rounded portrait with a picture of Victor and under it, that reads: Speaker - Victor Montalvao - Senior Group Design Manager at SmartRecruiters"
}
