{
	"title": "A11y for Devs: Using a Refreshable Braille & NVDA for Web Dev & CyberSecurity",
	"hosts": [
		"Elizabeth M.",
		"Marco C."
	],
	"startDate": "2024-09-16T18:00:00-04:00",
	"endDate": "2024-09-16T18:00:00-04:00",
	"status": "active",
	"locationType": "virtual",
	"image": "./images/600_523546105.webp",
	"tags": [
		"Events in",
		"Cybersecurity",
		"Accessibility",
		"JavaScript",
		"Software Development",
		"Web Development"
	],
	"details": "Details\n-------\n\n**This is our second Accessibility for Devs event and the first in-person one! Topic and location are TBA but register early as these events will fill up fast.**\n\n*   Would you like to advance your career and improve your software development skills with accessibility in mind?\n*   Are you curious about accessibility (\"a11y\") but don't know where to start?\n*   Have you attended other web accessibility events, but they seem to be geared more to designers and product managers?\n*   Do you know that accessibility is becoming increasingly important for legal, business, and human rights reasons?\n\n**Well then this is the series for you!**\n\nThe Accessibility for Devs Talk & Workshop Series is designed for developers and run by developers. Every event will have a live coding demo and/or hands on practice so you can level up your skills.\n\n**Location: Online**  \n**Topic: Using Refreshable Braille Display and NVDA Screen Reader for Web Development and CyberSecurity**  \n**Speaker: Florian Beijers**\n\n**About** **Accessibility for Devs Talk & Workshop Series:**\n\n*   On the third Monday of every month\n*   Alternating between online and in-person events\n*   Open to all skill levels\n*   Coding focus but no accessibility knowledge required\n*   Run by the new Accessibility Team at TorontoJS!\n\n\\*\\*\\*  \n**About TorontoJS:** ℹ️  \n**Did you know that our members and volunteers are not just in Toronto, and that we're not just JavaScript!** We welcome people from any field in tech and with any level of skills - from students and those considering a career change up to seasoned professionals with decades of experience.  \nTorontoJS is dedicated to providing a welcoming, safe, inclusive and supportive environment for all regardless of their gender, sexual orientation, disability, physical appearance, body size, race, or religion.  \nPlease read the [code of conduct](https://torontojs.com/code_of_conduct) prior to attending this meeting. [https://torontojs.com/code\\_of\\_conduct](https://torontojs.com/code_of_conduct)  \nWe welcome and encourage people who are disabled, neurodivergent, deaf/Deaf, LGBTQ2S+, and BIPOC, to attend events, get involved as members and to volunteer!  \n\\*\\*\\*  \n**Connect With TorontoJS 🔗**\n\n*   Website: [https://torontojs.com](https://torontojs.com)\n*   [Join us on Slack!](https://join.slack.com/t/torontojs/shared_invite/zt-zgi31snl-omO3tXSZ0Q7zqN9WBQSf8Q)\n*   Follow us on LinkedIn: [https://www.linkedin.com/company/torontojs/](https://www.linkedin.com/company/torontojs/)\n*   You can also find TorontoJS events on [Guild.host:](http://Guild.host:) [https://guild.host/torontojs/events](https://guild.host/torontojs/events)\n\n\\*\\*\\*  \n**Alt text for cover image:**  \nText:  \nAccessibility for Devs  \nTalk & Workshop Series  \nUsing a Refreshable Braille Display and NVDA Screen Reader for Web Dev & CyberSecurity  \nTime: 6pm - 7:45pm EST  \nOnline  \nDesign: Dark theme, black background, white text on the left and centre. Top left:White universal accessibility icon  \nOn the right there's a stylized grey CN tower on a red background that looks like flood lights shining up from the ground."
}
