{
  "title": "JS Hack Night",
  "hosts": [
    "dann"
  ],
  "startDate": "2015-12-08T18:30:00-05:00",
  "endDate": "2015-12-08T18:30:00-05:00",
  "status": "active",
  "locationType": "in-person",
  "image": null,
  "tags": [
    "Events in Toronto, ON"
  ],
  "details": "Details\n-------\n\nWe have a special workshop this month on Electron, a tool for building desktop applications with web technologies!\n\n———————\n\nAbout Electron:\n\nBuilding a cross platform desktop application is expensive. Also, deploying and distributing a cross platform desktop app is even bigger problem. That’s where Electron comes in. Electron allows developers to build cross platform desktop application with web technologies like HTML5, JS, CSS. Not only it makes it cheaper to build desktop apps, but also very accessible to web developer. Because of electrons, many companies have started building desktop apps to drive user engagement. Some examples are Slack, Microsoft Visual Studio Code, Atom, and Nuclide. These apps showcases the caliber of desktop apps Electron can produce.\n\n——————\n\nChinmay is the CEO and CO-Founder of API Garage, a platform to help developers design, document and test APIs. Chinmay has been a software developer for over last 7 years and has built over dozens of small-big projects. His favourite project is LinkedIn Profile View Extension. It’s a chrome extension with over 7000 users. He is also an open source contributor, and building a team of open source ninja’s in Toronto. His biggest achievements include winning Random Hacks of Kindness Hackathon and building features for Mozilla Thunderbird. He currently focuses full-time on improving and growing API Garage platform to improve API development flows for developers.\n\n——————\n\nHack nights are a time to slough off your workaday shackles and stretch the limits of what you can do in javascript. It's a chance to experiment with new tools and techniques, learn new paradigms and practices, commiserate and collaborate with fellow devs and make interesting things.\n\nWe work in small, self-assembled groups and we'll share our results at the end of the night.\n\nIt's important to have project ideas ahead of time, so please do the following:\n\n1.  subscribe to js weekly ([http://javascriptweekly.com/](http://javascriptweekly.com/))\n    \n2.  pick something interesting\n    \n3.  post a comment about it here\n    \n\nExamples of interesting projects:\n\n*   try a framework: noflo, meteor, ~todomvc, etc\n    \n*   try a library: q, [allong.es](http://allong.es), bilby, lemonad, etc\n    \n*   try a language: fay, elm, roy, clojurescript, flapjax, etc\n    \n*   try some web apis: audio, webgl, svg, webrtc, etc\n    \n*   go parallel: workers, river trail, webcl, etc\n    \n\nWe are beginner friendly. Here's some resources for getting up to speed with javascript:\n\nEloquent JS ([http://eloquentjavascript.net/](http://eloquentjavascript.net/))\n\nEffective JS ([http://effectivejs.com/](http://effectivejs.com/))\n\nJS Allonge ([https://leanpub.com/javascript-allonge](https://leanpub.com/javascript-allonge))\n\nFun JS ([http://shop.oreilly.com/product/0636920028857.do](http://shop.oreilly.com/product/0636920028857.do))\n\nAnother great way to learn JS is by reading the source of good libraries -- [underscore.js](http://underscore.js) ([http://underscorejs.org/](http://underscorejs.org/)) is a solid starting point."
}