{
	"title": "Women in Tech Online Social and New Volunteer Info Session",
	"hosts": [
		"Elizabeth M."
	],
	"startDate": "2024-08-13T18:30:00-04:00",
	"endDate": "2024-08-13T18:30:00-04:00",
	"status": "active",
	"locationType": "virtual",
	"image": "./images/600_522350696.webp",
	"tags": [
		"Events in",
		"Volunteering",
		"Women's Social",
		"UX Design",
		"Software Development",
		"Women in Technology"
	],
	"details": "Details\n-------\n\n**TorontoJS is starting a new, permanent Women in Tech program and series of events! If you're looking to become a part of and grow an in-person and online community of professional women in tech this is your chance!**\n\nThis online event is both an online social and an information session for new members and those interested in volunteering for in-person and/or virtual positions.\n\n**We welcome and encourage people who are disabled, neurodivergent, deaf/Deaf, LGBTQ2S+, and BIPOC, to attend events, get involved as members and to volunteer!**\n\n_This event is open to women, binary and non-gender people, and trans-women._\n\nCommitment for roles ranges from one evening a month and/or half an hour a week, through to leadership positions with long-term commitments.\n\nAll volunteers will be invited to attend volunteer only special events including the new \"May the Fourth annual volunteer party\"!\n\n**Did you know that our members and volunteers are not just in Toronto, and that we're not just JavaScript!** We welcome people from any field in tech and with any level of skills - from students and those considering a career change up to seasoned professionals with decades of experience.\n\nTorontoJS is dedicated to providing a welcoming, safe, inclusive and supportive environment for all regardless of their gender, sexual orientation, disability, physical appearance, body size, race, or religion.\n\n**Please read the [code of conduct](https://torontojs.com/code_of_conduct) prior to attending this meeting. [https://torontojs.com/code\\_of\\_conduct](https://torontojs.com/code_of_conduct)**\n\nWe also have a [Women in Tech Picnic on Sunday, August 11th](https://www.meetup.com/torontojs/events/301878114/) near Davisville station.\n\n_\\*\\* Men/males, if you're looking to volunteer please register for an [upcoming volunteer information session](https://www.meetup.com/torontojs/events/302102909/) and/or [join our Slack](https://join.slack.com/t/torontojs/shared_invite/zt-zgi31snl-omO3tXSZ0Q7zqN9WBQSf8Q) and post a comment in the general channel._\n\n**Connect With TorontoJS**\n\n*   Website: [https://torontojs.com](https://torontojs.com)\n*   [Join us on Slack!](https://join.slack.com/t/torontojs/shared_invite/zt-zgi31snl-omO3tXSZ0Q7zqN9WBQSf8Q)\n*   Follow us on LinkedIn: [https://www.linkedin.com/company/torontojs/](https://www.linkedin.com/company/torontojs/)\n*   You can also find TorontoJS events on [Guild.host:](http://Guild.host:) [https://guild.host/torontojs/events](https://guild.host/torontojs/events)\n\n**Alt text for cover image:**  \nText:Women in Tech Online Social! New Volunteer Info Meeting! 6:30PM - Tue, Aug 13  \nDesign: Dark theme, black background, white text on the left and centre. To the left of \"Women\" is an icon of two people and a plus symbol.  \nTo the left of \"New\" is a raised hand icon. On the right there's a stylized grey CN tower on a red background that looks like flood lights shining up from the ground."
}
