{
  "title": "React, Graphs, Realtime, Embeds - JS Tech Talk Night (RSVP on Guild!)",
  "hosts": [
    "dann",
    "Taz S."
  ],
  "startDate": "2023-11-09T18:45:00-05:00",
  "endDate": "2023-11-09T18:45:00-05:00",
  "status": "active",
  "locationType": "in-person",
  "image": "https://secure.meetupstatic.com/photos/event/e/1/b/3/600_516957779.webp?w=750",
  "tags": [
    "Events in Toronto, ON",
    "JavaScript",
    "JavaScript Applications",
    "JavaScript Frameworks",
    "JavaScript Libraries",
    "Web Technology"
  ],
  "details": "Details\n-------\n\n\\# 🙌 We’re back with an awesome evening of tech talks! We may even have a special discussion mixed in there too.\n\n👋 Come out and join us for a special event with some of our longest members who are coming together to share their knowledge with the community.\n\n**🎟️ RSVP now on Guild while there are places available!** Otherwise, you may be stuck on the waitlist **👻** [https://guild.host/events/react-graphs-realtime-lcaib9](https://guild.host/events/react-graphs-realtime-lcaib9)\n\n\\## **Schedule:**\n\n**6:30pm** - Doors Open\n\n**7:00pm** - **GraphQL federation and domain modelling**\n\n**Rohan Nair** is a technology leader, software developer, angel investor and fan of humanity, with over 13 years of experience in Toronto’s technology sector. He is currently the Head of Engineering at Nautical Commerce. Rohan has been an executive at many Toronto startups, and was the Head of Technology at venture capital firm Highline Beta. His career also includes stints as a startup founder and a fractional CTO for various companies. His diverse experiences give him a unique perspective on the intersection of technology and business.\n\n**7:30pm** - **Weird Graphs** Graphs are everywhere: in our interfaces, databases, editors, queries and more. Let's look at a few and see what stories they tell us.\n\n**Dann Toliver** enjoys building things, like data structures, distributed systems, programming languages, communities of smart friendly humans, and robot pony castles with his kids.\n\n**8:00pm** - **Wait you're using React Native on the Web?!** Taz dives into the skepticism of building React Native Apps for the Web, including everything from design systems and navigation to ExpoGL and Reanimated, from how they’ve successfully built Guild on top of this architecture.\n\n**Taz Singh** is the Founder of Guild and long time participant in communities around the world. He has over two decades of software experience ranging from video games & robotic AI to consumer application development, has served as a principal technical management consultant, and is a serial startup founder. When he's not behind his computer, he can be found chasing his cat around the house or being chased by cars around a race track.\n\n**8:30pm** - **Third-Party JavaScript Special Discussion** Join us with Ben Vinegar, the author of the book on \"Third-Party JavaScript\", and Taz Singh for a special discussion on the topic. This is one you won't want to miss! 👀\n\n**Ben Vinegar** is the General Manager of [Syntax.fm](http://Syntax.fm) at Sentry, where he also served as VP of Engineering from 2017-2021. Ben's also the co-author of Third-party JavaScript, and a contributor to O'Reilly's Beautiful JavaScript.\n\n**9:00pm** - Networking\n\n**10:00pm** - Doors Close  \nNote: All times in the schedule are an approximation.\n\n**Many thanks to VMWare for hosting us!**  \nWe're looking for sponsors for this event. If you or your company would like to support TorontoJS and get a message out to our community, please get in touch with \\[[organizers@torontojs.com](http://organizers@torontojs.com)\\]([mailto:organizers@torontojs.com](http://mailto:organizers@torontojs.com))\n\n[Code of Conduct](https://torontojs.com/p/code_of_conduct) is enforced at all TorontoJS events and spaces-online or in-person.\n\nGendered toilets and a single occupancy accessible toilet are available.\n\nTorontoJS is a volunteer-led not-for-profit organization. Kindly assist us with tidying up, as otherwise the venue staff and volunteers have to pick up after you."
}