{
	"title": "JS Workshop",
	"hosts": [
		"dann"
	],
	"startDate": "2017-08-08T18:30:00-04:00",
	"endDate": "2017-08-08T18:30:00-04:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nWelcome to the JS Workshop! This is a place for intermediate and advanced JavaScript developers to learn new skills, experiment with interesting technologies and have tons of fun.\n\nThis month Xavier Snelgrove will show us how to create organic 3D in WebGL -- it's going to be a delicious smorgasbord of abstract aesthetics!\n\nPrerequisites:\n\n*   A laptop with a web dev environment, including an editor and a local server\n    \n*   Some proficiency in JavaScript\n    \n*   A cheerful and inquisitive attitude\n    \n*   An appetite (for knowledge and for pizza -- thanks to New Relic for sponsoring us!)\n    \n\nThe evening revolves around two main pieces: the code-along and the group work. The first hour has the speaker coding on the projector, while the attendees copy that code into their own laptops. During the second hour we'll break into groups to extend that common code in new and exciting ways.\n\nTimetable:\n\n6:30 - doors open, eat pizza\n\n7:00 - workshop code-along\n\n8:00 - break for ideas and more pizza\n\n8:15 - extend the codebase in groups\n\n9:15 - demo round\n\n9:30 - everyone goes home\n\nA brief intro from Xavier:\n\nHi all, I'll be teaching how to used distance functions to raytrace 3d forms on the GPU using shaders written in GLSL. If you've worked in 3d you're probably used to representing objects as meshes of triangles. Instead here we'll represent an object as the level set of a function. This lets you build very different kinds of shapes, and transform them in very different ways. To see some pieces by one of the masters of this technique check out Ingo Quilez's article ([http://iquilezles.org/www/articles/raymarchingdf/raymarchingdf.htm](http://iquilezles.org/www/articles/raymarchingdf/raymarchingdf.htm)), and then check out his work running in real-time in your browser on Shadertoy ([https://www.shadertoy.com/view/llXGR4](https://www.shadertoy.com/view/llXGR4)). If you can't get the Shadertoy demo to work, then your browser may not support WebGL which we'll need for this workshop.\n\nFor a light introduction to GLSL check out the first few chapters of the Book of Shaders ([https://thebookofshaders.com/01/](https://thebookofshaders.com/01/)). We'll be working in their editor ([http://editor.thebookofshaders.com/](http://editor.thebookofshaders.com/)) for the workshop, which lets you see changes in real-time while you work. You can start playing with that now to get familiar with the language. Finally, for an intro to how the raytracing itself works, check out the Sphere Tracing blog series by Toronto's own Fab Castel ([http://fabricecastel.github.io/blog.html](http://fabricecastel.github.io/blog.html))\n\nWhile we won't assume prior experience with GLSL or raytracing, we'll be moving pretty quickly and assume you're comfortable with code.\n\nThe github repo that Xavier will be working through can be found here: [https://github.com/wxs/df-workshop](https://github.com/wxs/df-workshop)"
}
