{
	"title": "JS TechTalk: September edition with React Native & React, Typescript & GraphQL",
	"hosts": [
		"dann",
		"Matthew M."
	],
	"startDate": "2019-09-11T18:00:00-04:00",
	"endDate": "2019-09-11T18:00:00-04:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nWe are excited to announce our next JS Tech Talk event night!\n\nSpecial thanks to RED Academy ([https://redacademy.com/toronto/](https://redacademy.com/toronto/)) for providing the space!!\n\nIn addition a huge thank you to our sponsor for the event, the evening Food and Drink sponsor AND A/V sponsor will be by Tim Hortons!! AMAZE!\n\n// TALKS\n\n1.  Lightning Talks\n\nThroughout the event we have a few Lightning talks, you will hear from the following folks,\n\n*   Akshay Manchanda, React Context API\n*   Julien Assouline, D3\n\n2.  Simon Stern - React Native boilerplates\n\nReact Native is an open-source mobile application framework based on React. In this talk, we'll examine a few common ways to get started with React Native to get up and running fast. We'll look at 3 boilerplate options: Expo, Ignite, and Amplify, to see how they differ and how they can help us get started on a new React Native project.\n\nSimon is a full stack developer and AWS Solutions Architect with experience developing MVP's, complex feature integration, and developing automation and business solutions. He is an instructor and guest lecturer at RED Academy and has been a regular speaker at events in Toronto, along with publishing tutorials on Hackernoon. His clients have been featured in Cannes Lions Festival and BlogTO.\n\n3.  Asher Perlmutter - React + GraphQL on serverless infrastructure\n\nFrom the heads of technology at RBI: \"We is building a fully modern codebase using React, GraphQL, and Node on serverless infrastructure to power Tim Hortons, Burger King, and Popeyes mobile apps, websites, kiosks, and loyalty programs. Come meet with us and learn how we are transforming the restaurant industry.\"\n\nAsher's previously worked building out large cloud platforms at Google - GCP Kubernetes, and Microsoft - Workplace Analytics for O365. In his spare time he likes building mobile applications, playing volleyball and wakeboarding.\n\n4.  Rohan Nair - React + TypeScript, and GraphQL\n\nTypeScript and GraphQL are becoming important parts of the modern Frontend stack. In this talk, Rohan will demonstrate how to migrate an existing React app to TS and GQL.\n\nRohan is a technology executive, serial startup role-player, occasional founder and sometimes gets his hands dirty with code. He currently leads the technology organization at Highline Beta, with a deep focus in FinTech, and its future with emerging technologies like AI and Blockchain. A large part of his role includes telling his teammates to stop sending plaintext passwords via Slack. Rohan has previously built and led design, product, and technology teams at various Toronto startups.\n\n// SCHEDULE\n\n6:00pm - Doors open. Grab something to eat and network with attendees.\n\n6:20pm - Opening announcements. News and information about the Toronto JavaScript community and upcoming events.\n\n6:30pm - Simon - React Native boilerplates\n\n7:05pm - Lightning Talk\n\n7:20pm - Asher - React + GraphQL on serverless infrastructure at Tim Hortons, Burger King, and Popeyes\n\n7:55pm - Lightning Talk\n\n8:10pm - Rohan - React + Typescript, and GraphQL\n\n8:40pm - Closing remarks\n\n8:45pm - Goodbyes, give us a hand cleaning up the space, and post-event drinks at a local pub!\n\n// Note that the schedule is subject to change and accommodates 10-15  \n// minute breaks between sessions.\n\n// Interested in speaking or sponsoring?\n\n// Please email us at [team@torontojs.com](http://team@torontojs.com) for more information. All skill  \n// levels are welcome for talks!\n\n// Join us on Slack: [http://slack.torontojs.com/](http://slack.torontojs.com/)\n\n// Follow us on Twitter: [https://twitter.com/torontojs/](https://twitter.com/torontojs/)\n\n// See you there!"
}
