{
	"title": "JS Toastmasters",
	"hosts": [
		"Matthew M.",
		"3 others"
	],
	"startDate": "2022-04-14T18:00:00-04:00",
	"endDate": "2022-04-14T18:00:00-04:00",
	"status": "active",
	"locationType": "virtual",
	"image": null,
	"tags": [
		"Events in",
		"JavaScript",
		"JavaScript Applications",
		"JavaScript Frameworks",
		"JavaScript Libraries",
		"Web Technology"
	],
	"details": "Details\n-------\n\nWelcome to JS Toastmasters, where the main purpose of this event is for devs of all levels to get comfortable with speaking!\n\n[Code of Conduct](https://torontojs.com/p/code_of_conduct) applies.\n\n**Schedule**\n\n*   6:15 pm Opening comments\n*   6:20pm Rundown of Event Format\n*   Introduce Hosts + Speakers\n*   Thought of the Day\n*   Story Time from our \"Humour Master\"\n*   WOD ( Word of the day ): What kind of word could we use to expand our vocabulary?\n*   6:40pm Speaker: Let speakers discuss their topics.\n*   7:00 pm Break Time\n*   7:10 pm Table Topics\n*   8pm Wrap up\n\n**About**  \nThe purpose of this event is to get comfortable with speaking to small and larger groups.\n\nSpeakers will be confirmed beforehand. Speeches are supposed to be 10-20 min and don’t necessarily need to be technical. You can talk about yourself, your hobbies, a story, or how you got into coding, practice an upcoming presentation, attempt answering an interview question.  \nIf you have a presentation to give at work feel free to use this venue as a dry-run.  \nNote: This isn’t a platform to pitch or sell your startup idea, but you could use it to test the waters on telling the story of your startup.\n\n**Roles**  \nEach event will have TorontoJS members filling the roles as a learning/social experience!\n\nHost: This time we have the guidance of a seasoned Toastmaster organizer, Rachael Concessio!\n\nSpeakers: 1-2 speakers with quick talks that can be about anything at all (programming or not) as long as it complies with our Code of Conduct.\n\n\"Humour Master\": provides uplifting, profound or funny opening story to situate the audience. Think of the role like a yoga teacher trying to ground people instead of a standup comedian.\n\nTable Topic Master: Hosts the table topic event. Table topics is a fun activity that gives everyone a chance to participate by answering impromptu questions.\n\nEvaluators: provides feedback on how to improve speech and speaking\n\n**Guild Trial**  \nWe're also trialling a new platform for Events & Presentations - Guild!  \nPlease register for this event on Guild by following the link below, in order to assist us with the trial. Thank you!\n\n[https://beta.guild.host/events/WyJldmVudHMiLCI2MjMxNDk4NS05MzNhLTQ3NzYtOTU1Mi1jZmUwY2FiMTFkN2UiXQ==](https://beta.guild.host/events/WyJldmVudHMiLCI2MjMxNDk4NS05MzNhLTQ3NzYtOTU1Mi1jZmUwY2FiMTFkN2UiXQ==)"
}
