{
  "title": "PhoneGap & Ionic - October Tech Talk Night",
  "hosts": [
    "Taz S."
  ],
  "startDate": "2016-10-05T18:00:00-04:00",
  "endDate": "2016-10-05T18:00:00-04:00",
  "status": "active",
  "locationType": "in-person",
  "image": null,
  "tags": [
    "Events in Toronto, ON"
  ],
  "details": "Details\n-------\n\nFall! The season name they cut short because saying \"Fall in love with JavaScript\" was taking too long.\n\nWell you can all fall in love with our latest Tech Talk Night because we have the core PhoneGap and Ionic folks up to give a special event on their technologies!\n\nWe'd like to thank Adobe for sponsoring the event:  \nAdobe PhoneGap enables web developers to create beautiful and performant mobile apps using HTML, CSS and Javascript.\n\n6:00pm - Doors open. Grab a slice of pizza while networking with other attendees.\n\n6:30pm - Opening announcements. New and information about the Toronto JavaScript community and upcoming events.\n\n6:45pm - Ionic 2: Apps for the future - Mike Hartington ([https://twitter.com/mhartington](https://twitter.com/mhartington))  \nIonic has revolutionized the way web developers make the transition mobile development, but there’s always room to improve and make the lives of new app developers easier. With Ionic 2, we’ve improved upon much of what made Ionic 1 great, while also keeping things simple and reducing the fatigue that developers can feel when learning a new tool. We’ll introduce you to the basic Ionic 2 concepts and build an app live.\n\nAbout Mike  \nMike is a front-end developer who has used Ionic since its alpha. As Ionic’s developer advocate, Mike manages the Ionic Forum, serves as a resource to developers, and writes technical documentation. When he’s not working, you can find him relaxing with a beer and guitar.\n\n7:25pm - PhoneGap Plugins - Simon MacDonald ([https://twitter.com/macdonst](https://twitter.com/macdonst))  \nLearn what's new in the Apache Cordova/PhoneGap ecosystem. We are always striving to make it easier for developers to get started developing mobile applications. To that end we've developed a number of applications templates to boot strap your app. We've also been hard at work enhancing plugins like Push Notifications to remove the headache of getting setup and testing without a device. Also, we've introduced new plugins that are powered by Adobe's Creative SDK so you can add a powerful image editing component and sharing with desktop tools.\n\nSpeaking of desktop tools, we continue to add functionality to the PhoneGap Desktop and Developers apps. With these tools you can do most of your development in the browser without needing to setup Xcode and Android Studio. But if that is your jam we are making strides towards embedding the CordovaWebView into native apps even easier than what is available today.\n\nAbout Simon  \nSimon has over fifteen years of development experience and has worked on a variety of projects including object oriented databases, police communication systems, speech recognition and unified messaging. His current focus is contributing to the open source PhoneGap project to enable developers to create cross platform mobile applications using Web technologies. Simon’s been building web applications since the days they were written using shell scripts and he still has nightmares about those dark days.\n\n8:10pm - Fireside Chat with Speakers and Special Guest Holly  \nThis is your moment to ask the panelists your deepest most thought-inspiring questions about their talks or the web development ecosystem in general. It's your time to spark a conversation with the panelists and also the audience to bring about a greater discussion that we can all benefit from.\n\nAbout Holly - Follow her on Twitter ([https://twitter.com/devgirlFL](https://twitter.com/devgirlFL))  \nHolly works on the PhoneGap team at Adobe with a heavy focus on Developer Advocacy and Education via her blogging, sample apps and workshops. In her free time she’s usually found running, driving a carpool or hanging out with her family.\n\nFireside chat will be moderated by Tasveer Singh\n\nAbout Tasveer - Follow him on Twitter ([https://twitter.com/tazsingh](https://twitter.com/tazsingh))  \nTaz is a software architect with 15 years of experience in various aspects of computing and an organizer of Toronto JavaScript. He is more recently known for his work in the React and Elixir ecosystems. When he’s not tinkering with a computer, he can be found with his car at the local race track or rock climbing gym.\n\n9:00pm at the latest - Goodbyes, give us a hand cleaning up the space, and post-event drinks at a local pub!\n\nNote that the schedule is subject to change and accommodates 10-15 minute breaks between sessions.\n\nInterested in speaking or sponsoring?\n\nPlease email us at [team@torontojs.com](http://team@torontojs.com) for more information. All skill levels are welcome for talks!\n\nJoin us on Slack ([http://slack.torontojs.com/](http://slack.torontojs.com/))\n\nFollow us on Twitter ([http://twitter.com/torontojs](http://twitter.com/torontojs))\n\nSee you there!"
}