{
  "title": "”Doing “the right thing”: existential quandaries in software development\"",
  "hosts": [
    "Mike V.",
    "Jen C."
  ],
  "startDate": "2024-12-05T18:30:00-05:00",
  "endDate": "2024-12-05T18:30:00-05:00",
  "status": "active",
  "locationType": "virtual",
  "image": "./images/600_524870050.webp",
  "tags": [
    "Events in",
    "JavaScript",
    "Project Management",
    "Software Development"
  ],
  "details": "Details\n-------\n\n🙌 **TorontoJS Tech Talks \\[ Online \\] is back again!**  \nWe're thrilled to announce the return of TorontoJS Tech Talks to the virtual stage!  \nThe practice of building software every day involves making decisions, large and small. Every bug, incident, and feature raises questions of how to best solution for speed to market while maintaining quality and security. Besides banging out code, the work of software building requires getting buy-in on the approach and presenting risks or tradeoffs that can be uncomfortable and controversial.  \nIn this talk, Jen Chan recounts challenges and learnings from trying (and sometimes failing) to do “the right thing” on highly ambitious and challenging software projects.  \nBio:Jen Chan is a software developer who spent the last 8 years barreling through 3 startups, 2 agencies, 1 well-known public company. She lives in Toronto with a cat.\n\n👋 **Meet Our Special Guest,**  \n[Jen Chan](https://www.linkedin.com/in/jennifer7chan/)\n\n**Schedule:**  \n**6:30 pm**\\- Warm welcome and introduction by TorontoJS  \n**6:40 pm** - Presentation by our esteemed speaker.  \n**7:30 m** - Interactive Q&A Session  \n**7:45 PM** - Closing Remarks\n\nThis event will unfold on Zoom, bringing together minds from everywhere in an inspiring virtual space.  \nvolunteering\n\nInterested in speaking, volunteering, or sponsoring? Let's connect at ken\\[[@torontojs.com](http://@torontojs.com)\\]([mailto:organizers@torontojs.com](http://mailto:organizers@torontojs.com)).  \nTorontoJS is committed to creating a safe and inclusive environment for all. Our Code of Conduct applies both online and in person at all our events and spaces.\n\nFor more information on events @ TorontoJS please check out:  \n[https://guild.host/torontojs/events](https://guild.host/torontojs/events)  \nSee you there!"
}
