{
	"title": "Tech Talks: CardStack, Discourse and more!",
	"hosts": [
		"dann",
		"Matthew M."
	],
	"startDate": "2017-09-06T18:00:00-04:00",
	"endDate": "2017-09-06T18:00:00-04:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nThis month we're teaming up with EmberTO to bring you three great talks on three great topics! Edward Faulkner is in town for this talk night and a workshop at EmberTO on Thursday ([https://www.meetup.com/Toronto-Ember-JS-Meetup/events/242546049/](https://www.meetup.com/Toronto-Ember-JS-Meetup/events/242546049/)), Robin Ward is talking living styleguides and Tiff Nogueira is manage realtime data. It's going to be a night to remember!\n\nWe'd like to thank StrongLoop for sponsoring the event.\n\n6:00pm -- Doors open, food magically appears (thanks, StrongLoop!), people eat and talk (sequentially, not in parallel: manners are important)\n\n6:30pm -- Opening announcements, exciting news about upcoming events, and signal boosting for the Toronto JavaScript community\n\n6:45pm -- Tiff Nogueira\n\nRebuilding HackerYou's question-asking app, Helpme, while doubling down on state: How I used Redux and Firebase to manage realtime data.\n\nRedux and Firebase should both be treated as realtime stores. In this talk, I will explain how I used firebase's realtime events and redux's actions and reducers to keep my stores up to date.\n\nHaving previously worked in tourism, Tiff Nogueira’s sense of adventure led her to coding in 2015. Beginning her journey with HackerYou’s part-time web development courses, she went on to take the bootcamp program and began her career as a developer in Toronto’s start-up scene. Tiff is currently HackerYou’s Head of Part-Time Web Development, where she inspires others to learn digital skills and discover their passion.\n\n7:00pm -- Edward Faulkner\n\nBuild Higher Together: Cardstack, Ember, and re-decentralizing the web\n\nThe rise of front-end Javascript applications and massive community investments in shared tools are beginning to unlock a new kind of architecture and new kinds of software businesses. This is a talk about designing a framework for that future and how we can continue to grow our communities into a force that can empower users, re-decentralize the web, and disrupt stodgy-but-important enterprise software.\n\nEdward Faulkner is a member of the Ember core team and creator of Ember's official animation library. His open source code is running on mainstream gaming consoles, major social media sites, and hordes of enterprise applications. His consultancy, Polynomial LLC, leads ambitious software projects for a diverse group of businesses and nonprofits. He was previously a lead engineer at Akamai Technologies, where he built critical, internet-scale security infrastructure.\n\n7:50pm -- Robin Ward\n\nWe'll Do it Live: Integrating a Living Styleguide in your Application\n\nDiscourse, the popular open source forum software, has always been customizable via CSS and plugins. Over time people have demanded more sophisticated tools for adding themes to their forums, including sophisticated styleguides. This talk is about how we used [Ember.js](http://Ember.js) to integrate a living styleguide into our existing application, and leveraged our existing component and helpers to get the job done surprisingly quickly and effectively!\n\nRobin (Evil Trout) Ward is the co-founder of Discourse, and has been using [Ember.js](http://Ember.js) since it was in early betas. He loves building ambitious web applications and contributing to the open source world.\n\n8:30pm -- Goodbyes, give us a hand cleaning up the space, and post-event drinks at a local pub!\n\nThe schedule is subject to change, and accommodates short breaks between sessions.\n\nInterested in speaking or sponsoring? Please email us at [team@torontojs.com](http://team@torontojs.com) for more information. All skill levels are welcome for talks!\n\nJoin us on Slack ([http://slack.torontojs.com/](http://slack.torontojs.com/))\n\nFollow us on Twitter ([http://twitter.com/torontojs](http://twitter.com/torontojs))\n\nSee you there!"
}
