{
  "title": "July Tech Talk Night - Kitchener-Waterloo Edition - FOAM Framework, Ember, & Git",
  "hosts": [
    "Taz S."
  ],
  "startDate": "2015-07-16T18:30:00-04:00",
  "endDate": "2015-07-16T18:30:00-04:00",
  "status": "active",
  "locationType": "in-person",
  "image": null,
  "tags": [
    "Events in Toronto, ON"
  ],
  "details": "Details\n-------\n\nWe're back at Lighthouse Labs' beautiful space in the Burroughes Building for another edition of our Tech Talk Nights. This month, we're featuring technology from the Kitchener-Waterloo region and have two great speakers from that area. Our last speaker is a mystical creature who provides passage through the mountainous regions of JavaScript and also a local Torontonian.\n\nWe would like to thank Lighthouse Labs for sponsoring the event:  \nLighthouse Labs ([https://lighthouselabs.ca/](https://lighthouselabs.ca/)) has reimagined the developer bootcamp. After spending the last 1.5 years perfecting our groundbreaking program in Vancouver, we are launching right here in Toronto! It's about more than just learning to code: it's about becoming a developer. We've built our 8-week curriculum to hold students to a high standard of professional development while constantly iterating on that curriculum to keep it cutting-edge. We also believe development isn't always learned behind a computer. That's why Lighthouse Labs is teaching out of HIGHLINE, Toronto's most dynamic tech hub, and is keeping class sizes small while employing 40+ senior developers as mentors and TAs.\n\nIf you're an experienced web (JS, Ruby, Python, or the like) or iOS (Objective-C... not just Swift!) developer who enjoys mentoring junior developers then you should really look into mentoring / teaching at Lighthouse Labs! This is the perfect part-time gig, with scheduling flexible enough for developers at startups and larger companies, as well as freelancers. Minimum commitment is 5 hours a week but some of our teachers scale up to 20/week. Contact Khurram ( [khurram@lighthouselabs.ca](http://khurram@lighthouselabs.ca) ) to start a conversation!\n\n6:30pm - Doors Open. Grab a bite to eat and a beer to drink courtesy of Lighthouse Labs and network with other attendees.\n\n7pm - Opening Announcements. Information about TorontoJS, upcoming community events, and giveaways.\n\n7:10pm - Using Git to tell your project's story - Chris Silivestru ([https://twitter.com/chriscoit](https://twitter.com/chriscoit))  \nYour Git repository is the novelization of your project, it tells a story from beginning to end on how your project has changed over time. However, when 'used as prescribed', it can diminish its efficacy to the whole team.\n\nThis talk will cover why I believe that the three main tenants of how people use Git, hinder it's power. Throughout this talk I will dive into the following:\n\n*   How the 'why' is far more important than the 'what' when it comes to commit messages. Tense is almost irrelevant.\n*   We've been told not to use re-base because of its potential danger but in actuality when it is used effectively it can serve as a great tool.\n*   More commits are not necessarily better. Granularity is good but commits should aim to be atomic and not just granular.\n\nTo further show the difference, I will also be comparing a project following my process against one that follows the generic process.\n\nAbout Chris  \nChris Silivestru has over seven years in development experience. From web portal maintenance and software management for the City of Winnipeg to leading up the App’s Factory prototyping service, Chris has become very well versed in the realms of JavaScript, Mobile/Web Applications and Agile Methodologies. Chris is now lead developer and “Code Poet” at bitHound– a code insights solution for JavaScript, JSX and TypeScript projects.\n\n8pm - Introducing FOAM - Kevin Greer ([https://plus.google.com/+KevinGreer](https://plus.google.com/+KevinGreer))  \nFOAM is an open-source modeling framework written in JavaScript. With FOAM, you can create Domain Specific Languages (DSLs), which are high-level models that can be interpreted or compiled to different languages or environments. FOAM is built upon a small high-performance Model View Controller (MVC) library, which is itself modeled with FOAM. The MVC library features simplified dynamic value binding with Functional Reactive Programming, strong support of animations, a unified canvas/DOM view model, and composable Data Access Objects.\n\nFOAM increases developer productivity by allowing them to express solutions at a higher, more succinct level, and its MVC library increases application performance through its efficient data-binding, caching, and query-optimization mechanisms.\n\nKevin will explain FOAM with the aid of twenty five applications and demos written in FOAM.\n\nSee: [http://foamdev.com](http://foamdev.com) ([http://foamdev.com/](http://foamdev.com/))\n\nAbout Kevin  \nBefore leading the development of FOAM at Google, Kevin contributed to GMail and Chrome. He is passionate about design patterns, computer languages and frameworks, and was an early adopter of now well known technologies like Java, JavasScript, and the WWW. He co-authoring CGI HOW-TO (1996), which was one of the first books on programming the web. Outside of programming, Kevin enjoys spending time with his family, reading, and is a certified fitness instructor.\n\n8:50pm - Why Choose Ember? - Taras Mankovski ([https://twitter.com/embersherpa](https://twitter.com/embersherpa))  \nThe decisions that we make in the beginning of the project stay with us to the end. When choosing a frontend framework, we often focus on the code without considering other aspects of web development that can cause us to sink a lot of time. T​his talk brings to attention often overlooked aspects of web development and shows how Ember helps to address these issues.\n\nAbout Taras  \nTaras Mankovski is known in the [Ember.js](http://Ember.js) community as EmberSherpa. Taras spent the last several years mentoring developers to help them level up their [Ember.js](http://Ember.js) skills. He currently works with companies to help their team successfully implement Ember project and maintains a community of Ember developers who are active in the Ember community.\n\nNote that the schedule is likely to change and that the times are based on a 10-15 minute break between talks.\n\nIf you're interested in speaking or sponsoring at one of our events, please email us at [team@torontojs.com](http://team@torontojs.com)\n\nFollow us on Twitter: @torontojs ([https://twitter.com/torontojs](https://twitter.com/torontojs))  \nJoin us on Slack: [http://slack.torontojs.com](http://slack.torontojs.com)"
}