{
  "title": "JS Hack Night",
  "hosts": [
    "dann"
  ],
  "startDate": "2015-11-10T18:30:00-05:00",
  "endDate": "2015-11-10T18:30:00-05:00",
  "status": "active",
  "locationType": "in-person",
  "image": null,
  "tags": [
    "Events in Toronto, ON"
  ],
  "details": "Details\n-------\n\nHi everyone! We have a special workshop planned for tonight! Details follow:\n\nFOAM is a modeling framework for Javascript. Modeling means taking a high-level approach to data and applications: storage, network serialization, default views and more can all be built automatically from a model. A model plus 20 lines of code results in a server and client with Google authentication and persistent storage - leaving you free to focus on your client and business logic.\n\nFOAM combines that core modeling framework with an MVC system, Material Design view library, a collection of storage options (client and server), and efficient reactive programming (50k objects, 20k data bindings, 7k animating ([http://foam-framework.github.io/foam/foam/index.html?model=foam.demos.empire.Preso2#position=0](http://foam-framework.github.io/foam/foam/index.html?model=foam.demos.empire.Preso2#position=0))) to provide a complete system for building cloud applications with very little code.\n\nFOAM is about building fast apps fast.\n\n\\------------------------\n\nHack nights are a time to slough off your workaday shackles and stretch the limits of what you can do in javascript. It's a chance to experiment with new tools and techniques, learn new paradigms and practices, commiserate and collaborate with fellow devs and make interesting things.\n\nWe work in small, self-assembled groups and we'll share our results at the end of the night.\n\nIt's important to have project ideas ahead of time, so please do the following:\n\n1.  subscribe to js weekly ([http://javascriptweekly.com/](http://javascriptweekly.com/))\n    \n2.  pick something interesting\n    \n3.  post a comment about it here\n    \n\nExamples of interesting projects:\n\n*   try a framework: noflo, meteor, ~todomvc, etc\n    \n*   try a library: q, [allong.es](http://allong.es), bilby, lemonad, etc\n    \n*   try a language: fay, elm, roy, clojurescript, flapjax, etc\n    \n*   try some web apis: audio, webgl, svg, webrtc, etc\n    \n*   go parallel: workers, river trail, webcl, etc\n    \n\nWe are beginner friendly. Here's some resources for getting up to speed with javascript:\n\nEloquent JS ([http://eloquentjavascript.net/](http://eloquentjavascript.net/))\n\nEffective JS ([http://effectivejs.com/](http://effectivejs.com/))\n\nJS Allonge ([https://leanpub.com/javascript-allonge](https://leanpub.com/javascript-allonge))\n\nFun JS ([http://shop.oreilly.com/product/0636920028857.do](http://shop.oreilly.com/product/0636920028857.do))\n\nAnother great way to learn JS is by reading the source of good libraries -- [underscore.js](http://underscore.js) ([http://underscorejs.org/](http://underscorejs.org/)) is a solid starting point."
}