{
  "title": "TorontoJS Presents: International Women's Day North America 2023 #WTMDareToBe",
  "hosts": [
    "Sherry Y.",
    "2 others"
  ],
  "startDate": "2023-04-27T12:00:00-04:00",
  "endDate": "2023-04-27T12:00:00-04:00",
  "status": "active",
  "locationType": "virtual",
  "image": "https://secure.meetupstatic.com/photos/event/1/b/1/9/600_512046937.webp?w=750",
  "tags": [
    "Events in",
    "Engineering Leadership",
    "Personal Branding",
    "Diversity & Inclusion",
    "Professional Development",
    "Technology Startups"
  ],
  "details": "Details\n-------\n\nJoin us on YouTube Live for this returning event at TorontoJS, **TorontoJS Presents: International Women's Day North America 2023 #WTMDareToBe**.\n\nWomen Techmakers (WTM) Ambassadors are collaborating with TorontoJS again! To celebrate International Women's Day (IWD) 2023 we are going live on YouTube Live. This year's running theme from WTM is #WTMDareToBe to enhance IWD 2023 campaign theme #EmbraceEquity. A TorontoJS organizer and WTM Ambassador, Sherry Yang will be live for two hours hosting a list of speakers powered by Google and random prize draws 🎁. Stay tuned for what's coming to your screens on April 27th!\n\nMeanwhile, checked out what happened last year in [this playlist](https://youtube.com/playlist?list=PLXoUTKvTK5ZX4THsAg-1cEmfjxh5bVuQf).\n\n**AGENDA**\n\n*   12:00 - Welcome remarks\n*   12:10 - Caitlin Morrissey + live Q&A\n*   12:40 - Janine Lee + live Q&A\n*   13:10 - Macy Kuang + live Q&A\n*   13:40 - Closing remarks\n*   14:00 - Event closed\n\n**SPEAKERS**  \nSome topics that may be covered: personal brand, inclusive teams, career journey, startup ecosystem, and team management.\n\n**Caitlin Morrissey - WTM Global Program Lead, Google**  \nAn international leader with more than a decade of experience working with Google. She supports and empowers 1,800+ leaders around the world creating an impact in their tech communities with the mission to collectively build a world where all women thrive in tech.\n\n**Janine Lee - Global L&D Strategy & Operations Leader, Google**  \nAn experienced Global L&D Leader with a background in career development, DEI, and change management. She’s a Certified Executive Coach, Adjunct Professor, and Ed.D 2023 Doctoral Candidate in Organizational Change & Leadership. Her research focuses on increasing sense of belonging for Women of Color in Technology. Janine has won dozens of international awards for her leadership and DEI efforts.\n\n**Macy Kuang - Senior Software Engineer, Miaomiao Games**  \nA well-known public speaker and Google Developer Expert for IoT and wearable technologies. With over a decade of experience in the gaming industry, Macy has made significant contributions to the development of popular games. She has earned a reputation as a leading expert in AR and VR development.\n\n**CONNECT WITH US**  \nTorontoJS - [https://torontojs.com/](https://torontojs.com/)  \nWomen Techmakers - [https://www.womentechmakers.com/](https://www.womentechmakers.com/)  \nSherry Yang - [https://twitter.com/5hel2l2y](https://twitter.com/5hel2l2y)\n\n**SOCIAL MEDIA TAGS**  \n#WTMDareToBe  \n#IWD2023  \n#EmbraceEquity\n\n**CODE OF CONDUCT**  \n[https://torontojs.com/p/code\\_of\\_conduct](https://torontojs.com/p/code_of_conduct)  \n[https://developers.google.com/community-guidelines](https://developers.google.com/community-guidelines)"
}