{
  "title": "Design Talk: Driving Adoption of an Enterprise Design System",
  "hosts": [
    "Marco C.",
    "2 others"
  ],
  "startDate": "2024-11-06T18:00:00-05:00",
  "endDate": "2024-11-06T18:00:00-05:00",
  "status": "active",
  "locationType": "in-person",
  "image": "https://secure.meetupstatic.com/photos/event/5/e/1/d/600_524544093.webp?w=750",
  "details": "<div class=\"flex items-center justify-between\"><h2 class=\"text-xl font-semibold\">Details</h2></div><div class=\"break-words\"><p class=\"mb-4\">You are invited to learn from <strong>Guy Segal</strong>, a seasoned UX Design Director and Design Systems Specialist with <strong>20+ years</strong> of experience! He's the Director of Design + Design Systems at Thomson Reuters.</p>\n<p class=\"mb-4\">From his roots as a <strong>software developer</strong>, Guy evolved into <strong>UX design</strong> and rose to leadership roles, sharing insights as a manager, mentor, and speaker on <strong>human-centred</strong> communication.</p>\n<p class=\"mb-4\">📢 <strong>Join us for this FREE event featuring learning 💻, pizza 🍕, and networking 🤝!</strong></p>\n<p class=\"mb-4\">❓<strong>Bring your questions for a special Q&amp;A session!</strong></p>\n<p class=\"mb-4\">***<br>\n<strong>About Design Talk Series</strong></p>\n<ul class=\"pl-5 list-disc mb-4\">\n<li>Would you like to advance your career and improve your UI/UX Design and Frontend skills?</li>\n<li>Are you a graphic designer who wants to improve your UI design skills?</li>\n<li>Are you a front-end developer who wants to improve your design and Figma skills?</li>\n<li>Would you like to be part of a tech meetup community where developers listen to and value designers?</li>\n<li>Are you curious to learn about something new?</li>\n</ul>\n<p class=\"mb-4\"><em>Well, then this is the series for you!</em></p>\n<p class=\"mb-4\">***<br>\n<strong>About TorontoJS:</strong> ℹ️<br>\nDid you know that our members and volunteers are not just in Toronto and that we're not just JavaScript? We welcome people from any field in tech and with any level of skills—from students and those considering a career change to seasoned professionals with decades of experience.<br>\nTorontoJS is dedicated to providing a welcoming, safe, inclusive and supportive environment for all regardless of their gender, sexual orientation, disability, physical appearance, body size, race, or religion.<br>\nPlease read the <a href=\"https://torontojs.com/code_of_conduct\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">code of conduct</a> before attending this meeting. <a href=\"https://torontojs.com/code_of_conduct\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">https://torontojs.com/code_of_conduct</a><br>\nWe welcome and encourage people who are disabled, neurodivergent, deaf/Deaf, LGBTQ2S+, and BIPOC, to attend events, get involved as members and volunteer!<br>\n***<br>\n<strong>Connect With TorontoJS 🔗</strong></p>\n<ul class=\"pl-5 list-disc mb-4\">\n<li>Website: <a href=\"https://torontojs.com\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">https://torontojs.com</a></li>\n<li><a href=\"https://join.slack.com/t/torontojs/shared_invite/zt-zgi31snl-omO3tXSZ0Q7zqN9WBQSf8Q\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">Join us on Slack!</a></li>\n<li>Follow us on LinkedIn: <a href=\"https://www.linkedin.com/company/torontojs/\" target=\"_blank\" class=\"!text-viridian\" rel=\"ugc\">https://www.linkedin.com/company/torontojs/</a></li>\n<li>You can also find TorontoJS events on <a href=\"http://Guild.host:\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">Guild.host:</a> <a href=\"https://guild.host/torontojs/events\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">https://guild.host/torontojs/events</a></li>\n</ul>\n<p class=\"mb-4\">***<br>\n<strong>Alt text for cover image:</strong><br>\nThe image is a promotional graphic for a design talk. To the left, there is a red square logo with the letters \"JS\" and an illustration of the CN Tower. Next to the logo, the text \"DESIGN TALK\" appears, with \"DESIGN\" in black and \"TALK\" in red. Below, a bold headline reads, \"SCALING ADOPTION AND ADVOCACY FOR AN ENTERPRISE-WIDE DESIGN SYSTEM:\" in black capital letters. Underneath, there is a description in smaller text about building a platform-agnostic design system. Further below, event details are listed with a calendar icon and date-time information on the left, and a location pin icon with the venue address on the right. On the right side of the graphic is a circular photo of a man with glasses, smiling, against a white background. Below the photo, the text introduces the speaker, \"Guy Seagal,\" with his title and affiliation.<br>\nAlt-text: Promotional image for a design talk featuring event details and speaker Guy Seagal.<br>\nTranscribed Text: DESIGN TALK<br>\nSCALING ADOPTION AND ADVOCACY FOR AN ENTERPRISE-WIDE DESIGN SYSTEM: How we built a platform agnostic design system that everyone could benefit from, and promoted adoption across a fragmented organization.<br>\nNovember 6, 2024 6:00pm - 9:00pm<br>\nSentry, 129 Spadina Ave., Toronto, ON<br>\nSpeaker Guy Seagal Director, Design + Design System @Thomson Reuters<br>\n***<br>\nArt by our volunteer Lean De Leon</p></div>",
  "tags": [
    "Events in Toronto, ON",
    "Web Accessibility",
    "JavaScript",
    "Software Development",
    "Web Development",
    "Tech Talks"
  ]
}