{
  "title": "TorontoJS x FutureMakers Mega Meetup!",
  "hosts": [],
  "startDate": "2018-09-26T17:00:00-04:00",
  "endDate": "2018-09-26T17:00:00-04:00",
  "status": "active",
  "locationType": "in-person",
  "image": null,
  "tags": [
    "Events in Toronto, ON"
  ],
  "details": "Details\n-------\n\nThis month we have a MEGA MEETUP™️! 🙂 Seriously, we're joining up with the RBC FutureMakers and three other local tech communities for a huge event at the Metro Toronto Convention Centre!\n\nWe would like to thank RBC FutureMakers for inviting us. They're providing food and beverages (one drink ticket for everyone on the house!)\n\nPlease RSVP at [https://futuremakers-mega-meetup.eventbrite.com](https://futuremakers-mega-meetup.eventbrite.com) and also here so we have an idea of the numbers.\n\n// TALKS\n\n1.  Dan Steinman - Jaxcore Spin Introduction\n\nDan will demonstrate an innovative new IoT peripheral - the world's first wifi volume knob and dial remote control for that is fully programmable with JavaScript.\n\nDan is a long-time JavaScript enthusiast who's bringing his expertise to the world of web-connected hardware. [https://twitter.com/jaxcore](https://twitter.com/jaxcore)\n\n2.  Branko Culum - PlinkoJS: Building an In-Browser Networked Physics Game in Javascript\n\nPlinkoJS is a real-time, browser-based, multiplayer physics game. It was built using Javascript, [Node.js](http://Node.js), React, and WebSockets. PlinkoJS features a client-server architecture which synchronizes game state for multiple clients in real-time, allowing for real-time gameplay. This game features only technology native to the browser and does not depend on any special client-side plugins as most networked games do.\n\nBranko Culum is a full-stack web developer who loves exploring how the web can be used to create real-time, collaborative experiences. [http://brankoculum.github.io/](http://brankoculum.github.io/)\n\n3.  Third speaker wanted! Please email us at [team@torontojs.com](http://team@torontojs.com) if you would like to give a talk.\n\n// SCHEDULE\n\n4:30pm - Doors open. Grab something to eat and network with attendees.\n\n5:30pm - RBC Opening Remarks and Keynote.\n\n6:00pm - Opening announcements. News and information about the Toronto JavaScript community and upcoming events.\n\n6:05pm - Dan Steinman - Jaxcore Spin Introduction\n\n6:35pm - Branko Culum - PlinkoJS: Building an In-Browser Networked Physics Game in Javascript\n\n7:10pm - Third speaker wanted - contact [team@torontojs.com](http://team@torontojs.com) if you would like to give a talk.\n\n7:40pm - Wrap-up and networking.\n\n// Note that the schedule is subject to change and accommodates short  \n// breaks between sessions.\n\n// Interested in speaking or sponsoring?\n\n// Please email us at [team@torontojs.com](http://team@torontojs.com) for more information. All skill  \n// levels are welcome for talks!\n\n// Join us on Slack: [http://slack.torontojs.com/](http://slack.torontojs.com/)\n\n// Follow us on Twitter: [http://slack.torontojs.com/](http://slack.torontojs.com/)\n\n// See you there!"
}