{
  "title": "Toronto's Web Apps and HTML5 Games Code-Along",
  "hosts": [
    "Taz S."
  ],
  "startDate": "2013-04-06T10:00:00-04:00",
  "endDate": "2013-04-06T10:00:00-04:00",
  "status": "active",
  "locationType": "in-person",
  "image": null,
  "tags": [
    "Events in 6th floor, ON"
  ],
  "details": "Details\n-------\n\nOn April 6th, we’re planning our second workshop alongside DevTO, HTML5 Toronto, TorontoJS and Make Web Not War. This one will focus on highlighting applications and games built using javascript and web technologies. We’ve got a couple of excellent speakers coming in from the local community.\n\nPurchase your ticket by March 30th and get entered to win an Xbox + Kinext bundle! ([https://www.atendy.com/event/microsoft-windows-8-workshop-2-5436](https://www.atendy.com/event/microsoft-windows-8-workshop-2-5436))\n\nPrerequisites. If you want to get the most out of this and other workshops it is recommended to install Windows 8 ([http://msdn.microsoft.com/en-US/evalcenter/jj554510.aspx?wt.mc\\_id=MEC\\_132\\_1\\_4&utm\\_source=DevTO+Attendees&utm\\_campaign=83e53ed48e-\\_DevTO\\_Microsoft\\_Windows\\_8\\_Workshop\\_13\\_2\\_2013&utm\\_medium=email](http://msdn.microsoft.com/en-US/evalcenter/jj554510.aspx?wt.mc_id=MEC_132_1_4&utm_source=DevTO+Attendees&utm_campaign=83e53ed48e-_DevTO_Microsoft_Windows_8_Workshop_13_2_2013&utm_medium=email)). You can install it directly or host it in a Virtual Machine, including a Mac.You will want to install the tools and SDK ([http://msdn.microsoft.com/en-US/windows/apps/br229516?utm\\_source=DevTO+Attendees&utm\\_campaign=83e53ed48e-\\_DevTO\\_Microsoft\\_Windows\\_8\\_Workshop\\_13\\_2\\_2013&utm\\_medium=email](http://msdn.microsoft.com/en-US/windows/apps/br229516?utm_source=DevTO+Attendees&utm_campaign=83e53ed48e-_DevTO_Microsoft_Windows_8_Workshop_13_2_2013&utm_medium=email)) and, if you get a chance, read Designing great games for Windows ([http://msdn.microsoft.com/en-ca/library/windows/apps/hh868271.aspx](http://msdn.microsoft.com/en-ca/library/windows/apps/hh868271.aspx)). If you don’t install anything, no worries, you will still be able to follow along. USB sticks and help will be available to get your computers ready to code-along.\n\nSubmit your apps. If you think you have a great idea, we are having an application showcase competition where we will be giving away a Surface RT. Simply submit the URL of your idea hosted on a Microsoft platform (like the free trial of Azure) to \\[masked\\] where you will be added to a list of presenters to be given a 2 minute “Best At” style pitch where the audience will be the judge, not just the ones there but also those online. We will be streaming the whole event as well so you can have friends and colleagues help vote for you too.\n\nPrizes. Ticket price will be $5 and for those that register by March 30th, you’ll be entered to win an Xbox & Kinect Bundle.\n\nCode-along. Along with speakers throughout the morning, we will also have a code-along for developing Windows 8 applications using web tools. We’ll have experts on-hand to provide 1-1 support to answer questions about using frameworks, best practices for user experience, and server side solutions for managing your application’s data."
}