{
  "title": "May Tech Talk Night - Real Time Web Applications",
  "hosts": [
    "dann",
    "Taz S."
  ],
  "startDate": "2014-05-22T18:30:00-04:00",
  "endDate": "2014-05-22T18:30:00-04:00",
  "status": "active",
  "locationType": "in-person",
  "image": null,
  "tags": [
    "Events in Toronto, ON"
  ],
  "details": "Details\n-------\n\nSummer, the season made for Tech Talk Nights! Come join us at Nulogy's office for talks focusing on Real Time Web Applications.\n\nWe'd also like to thank Nulogy for sponsoring the venue, food, and drinks for the event. Be sure to check out their website ([http://nulogy.com/](http://nulogy.com/)) (it's very well designed and I've probably complimented them on it 20 times now! ([http://www.reactiongifs.com/wp-content/uploads/2013/06/bravo.gif](http://www.reactiongifs.com/wp-content/uploads/2013/06/bravo.gif))).\n\nNulogy ([http://nulogy.com/](http://nulogy.com/)) provides software and services that allow brands and their suppliers to bring personalized products to consumers more quickly, safely, and intelligently. For over the past decade, Nulogy has been solving problems that no one else could solve in the supply chain. We are engineers, designers, scientists, domain experts, and people-people. We’re passionately building and supporting state-of-the-art technology solutions that connect partners, manage operations, and reveal insights in ways that were never before possible. We wake up every day, excited to make real world change through our incredible software and client experiences. Learn more at [nulogy.com](http://nulogy.com) ([http://nulogy.com/](http://nulogy.com/)).\n\nThe kind folks at FITC have given us 2 tickets to give away for their upcoming FITC Spotlight: AngularJS event on June 7th ([http://fitc.ca/event/angularjs/](http://fitc.ca/event/angularjs/)). It looks like it'll be another excellent event with some awesome speakers and talks already lined up. Grab a ticket before the Early Bird deadline ends ([http://www.eventbrite.ca/e/fitc-spotlight-angularjs-tickets-11356982039](http://www.eventbrite.ca/e/fitc-spotlight-angularjs-tickets-11356982039)) or attend our Tech Talk Night for a chance to win a free ticket!\n\n6:15pm - Doors Open. Grab a bite to eat and chat with other attendees.\n\n7pm - Preparing for Equity Crowdfunding - John Wires ([https://twitter.com/johnwires](https://twitter.com/johnwires))  \nCrowdfunding represents a game changing opportunity for startups to access capital. The Ontario Securities Commission recently announced that an equity crowdfunding exemption may be available for startups as early as the first quarter of 2015. John will be speaking about what you can do to prepare for equity crowdfunding and how Ontario’s crowdfunding framework will work.\n\nAbout John  \nJohn Wires ([http://wireslaw.ca/about-wires-law-john-wires/](http://wireslaw.ca/about-wires-law-john-wires/)) is the founder of Wires Law ([http://wireslaw.ca/](http://wireslaw.ca/)), a corporate commercial law firm delivering legal services to entrepreneurs and small and medium sized businesses across Canada. His practice focuses on launching, protecting and selling Canadian businesses. He has appeared in the Ontario Superior Court, the Ontario Court of Appeal and private arbitrations on issues spanning from shareholder and employment disputes to cross border litigation. John has been a guest lecturer at Ryerson University and covered in the media on Crowdfunding in Canada. He serves as an advisor to the National Crowdfunding Association and acts as legal counsel for clients who have successfully raised money on popular crowdfunding websites.\n\n7:30pm - Meteor: productive app development with realtime for free - Paul Dowman ([https://twitter.com/pauldowman](https://twitter.com/pauldowman))  \nToday's web app is no longer just static pages generated on the server. The browser is a great app platform, but a modern app is now two apps that must communicate. RESTful HTTP requests have been the answer for two decades but reloading a page to check for updates is not good enough any more. Is \"pull to refresh\" really the state of the art? What if it were possible to build one app that spans client and server, with reactive UI updates in real-time?\n\nLearn how Meteor is different from other web frameworks and how Meteor’s design makes it as productive and easy to use as Rails, but built for the modern era, with real-time UI updates by default.\n\nAbout Paul  \nPaul Dowman has been developing web apps professionally since 1995. He’s the founder of OK GROW! ([http://www.okgrow.com/](http://www.okgrow.com/)) where he develops web and mobile apps for clients using Meteor and teaches a Meteor Workshop ([http://www.okgrow.com/meteor/learn/](http://www.okgrow.com/meteor/learn/)).\n\n8:30pm - A case for REST in the real-time Web - Anson MacKeracher ([https://twitter.com/amackera](https://twitter.com/amackera))  \nRecent developments in web technology have enabled far more sophisticated and reactive applications to flourish; however, a huge number of applications were designed before these technologies were prevalent. Given the success of REST, and the power of the real-time Web, can we find a happy medium?\n\nThis talk will cover modernizing existing RESTful architectures to take advantage of new paradigms such as Websockets, Server-sent events, and real-time servers.\n\nAbout Anson  \nAnson has spent the last 4 years developing and refining the technology behind Top Hat ([https://tophat.com/](https://tophat.com/)). As Top Hat's Chief Architect, Anson is primarily interested in crafting reliable, scalable, and performant application architectures.\n\nSee you there!"
}