{
  "title": "TorontoJS PubScript Social at The Firkin on Yonge!",
  "hosts": [
    "Elizabeth M.",
    "2 others"
  ],
  "startDate": "2024-06-07T18:30:00-04:00",
  "endDate": "2024-06-07T18:30:00-04:00",
  "status": "active",
  "locationType": "in-person",
  "image": "https://secure.meetupstatic.com/photos/event/9/f/2/0/600_521320736.webp?w=750",
  "details": "<div class=\"flex items-center justify-between\"><h2 class=\"text-xl font-semibold\">Details</h2></div><div class=\"break-words\"><p class=\"mb-4\"><strong>We're BACK! Your favourite TorontoJS social event at at pub is being resurrected after the pandemic. And the best part is, it will more inclusive and wheelchair accessible this time. Current, past, and new members welcome, as are drinkers and non-drinkers!</strong></p>\n<p class=\"mb-4\">Friends + Code + Pub = FUN!</p>\n<p class=\"mb-4\">TorontoJS PubScript event is a fun relaxed event where like-minded individuals get together, have a snack, meal, or drink, network, and talk JavaScript and software development.</p>\n<p class=\"mb-4\">Ping pong / table tennis table will be available for the first event, and there are dart boards located at the back of the second floor.<br>\nEveryone is welcome to join us. If you are coming for the first time, don't be shy!</p>\n<p class=\"mb-4\">This is a relaxed social event. It's totally fine if you need to arrive late or leave early.</p>\n<p class=\"mb-4\"><strong>Due to accessibility issues on <a href=\"http://Guild.host\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">Guild.host</a> we're opening up registrations here on Meetup.</strong><br>\nAttendees can also register on Guild <a href=\"https://guild.host/events/torontojs-pubscript-4q67tb\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">https://guild.host/events/torontojs-pubscript-4q67tb</a> to reserve their spot</p>\n<p class=\"mb-4\"><strong>Location</strong><br>\nThe Firkin on Yonge is on the east side of Yonge Street, just north of Queen Street and across from the Eaton Centre.<br>\nFirkin on Yonge<br>\n207 Yonge St<br>\nToronto, Ontario<br>\nM5B 2H1<br>\n<a href=\"https://maps.app.goo.gl/VrNqHrUmS46jgMESA\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">Google Maps link</a></p>\n<p class=\"mb-4\"><strong>Menu</strong><br>\n<a href=\"https://www.firkinpubs.com/firkinonyonge/menus/\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">View the menu online.</a><br>\nTraditional English and North American pub food is available, as are alcoholic and non-alcoholic drinks options.</p>\n<p class=\"mb-4\"><strong>Notes:</strong></p>\n<ul class=\"pl-5 list-disc mb-4\">\n<li><strong>The TorontoJS Code of Conduct applies. Be nice!</strong> <a href=\"https://torontojs.com/code_of_conduct\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">Read the code of conduct online.</a></li>\n<li><strong>Please make sure to be respectful to staff and tip well!</strong></li>\n<li><strong>The Firkin isn't charging TorontoJS a booking fee for the PubScript series of socials or other social events.</strong></li>\n<li><strong>We're thrilled to have a free venue for regular social events and want to keep a positive relationship with the Firkin!</strong></li>\n<li>We have members, volunteers, and future guests who use mobility aids (walking canes, wheelchairs, and service dogs) - including ones organizing our social events.</li>\n<li><strong>Under no circumstances should anyone ever touch a mobility aid (e.g. mobility cane, crutches, or wheelchair) or distract a service dog!</strong> Treat mobility aids as extensions of a person - even when the person isn't currently using their mobility aid. If you need a mobility aid moved, ask the person it belongs to.</li>\n</ul>\n<p class=\"mb-4\">### <strong>Transit:</strong></p>\n<ul class=\"pl-5 list-disc mb-4\">\n<li>TTC: Right near Queen TTC Station, and on the Yonge bus line</li>\n<li>GO Transit: Two stops north of Union Station on the Yonge subway line</li>\n</ul>\n<p class=\"mb-4\">### <strong>Cycling:</strong></p>\n<ul class=\"pl-5 list-disc mb-4\">\n<li>Close to the Richmond and Adelaide east/west cycle tracks</li>\n<li>There's Bike Share Toronto docking stations nearby. The closest is on Richmond Street at Yonge.</li>\n</ul>\n<p class=\"mb-4\">### <strong>Driving:</strong></p>\n<ul class=\"pl-5 list-disc mb-4\">\n<li>Check with Green P for public parking lots. With the Firkin on Yonge being in the heart of downtown Toronto there's parking, but it's much easier to take transit.</li>\n</ul>\n<p class=\"mb-4\">## <strong>Accessibility Notes:</strong></p>\n<p class=\"mb-4\">### <strong>Venue</strong></p>\n<p class=\"mb-4\">The Firkin is wheelchair accessible with level access, elevator to the second floor and to the washrooms in the basement. Washrooms are accessible with accessible stalls in each gendered washroom. The Firkin hosts events by A11yTO, so the staff handles disability accommodation requests professionally and respectfully.</p>\n<p class=\"mb-4\">### <strong>Transit</strong></p>\n<p class=\"mb-4\">The closest accessible station is Queen Station. There is currently (Monday, June 3rd) one elevator out of service at Queen Station. Exiting via southbound and northbound is working (we've tested). For Southbound use Eaton Centre concourse to street.</p>\n<p class=\"mb-4\">Please call the Lift Line Service before you travel. 416-539-LIFT (5438).</p>\n<p class=\"mb-4\">The closest accessible TTC routes are:</p>\n<ol class=\"pl-5 list-decimal mb-4\">\n<li>Yonge bus north to Dundas Station or Wellesley Station</li>\n<li>St. Andrew Station, then the King Street streetcar east to Yonge Street. Walk or roll north three blocks. The streetcar tracks on the east side of Queen are filled in so it's an easy wheel over them (no front casters getting stuck)!</li>\n<li>Union, then the Bay bus north. Catch the bus at the SE corner of Bay and Front Streets. Get off at Queen and Bay. Walk or roll east one block. (Note there is construction so it's quite a tight sidewalk with bumps.)</li>\n</ol>\n<p class=\"mb-4\">WheelTrans can drop off on Yonge. The Firkin entrance is right near the stairway TTC entrance on the sidewalk.</p>\n<p class=\"mb-4\">If you need accessibility accommodations or use assistive tech and prefer to register via Google forms, please reply to this form: <a href=\"https://forms.gle/FqQf6w8csEJjehiF7\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">https://forms.gle/FqQf6w8csEJjehiF7</a></p>\n<p class=\"mb-4\">***Please contact the organizers if you have any accessibility questions or concerns.***</p>\n<p class=\"mb-4\">Alt text for cover image:<br>\nSquare graphic. Says \"TorontoJS PubScript\" inside a London Underground roundel sign.<br>\nWhite text on blue background: \"Monthly Pub Socials!<br>\n6:30pm Every First Friday of the Month<br>\nThe Firkin on Yonge (at Queen). 2nd floor lounge. Darts and ping pong<br>\nNear Queen Subway Station<br>\nWheelchair accessible. TorontoJS logo with CN Tower and JS is in the bottom left corner.</p></div>",
  "tags": [
    "Events in Toronto, ON",
    "User Experience",
    "JavaScript",
    "Software Development",
    "Web Technology",
    "Technology"
  ]
}