{
  "title": "JS Social: In-Person -  Job Seekers’ Event with Morgan McKinley",
  "hosts": [
    "Danny K."
  ],
  "startDate": "2023-06-24T11:00:00-04:00",
  "endDate": "2023-06-24T11:00:00-04:00",
  "status": "active",
  "locationType": "in-person",
  "image": null,
  "tags": [
    "Events in Toronto, ON",
    "JavaScript",
    "Software Development",
    "JavaScript Applications",
    "Web Development",
    "Web Technology"
  ],
  "details": "Details\n-------\n\n_**\\*\\* REGISTRATION IS CLOSED NOW \\*\\***_  \n_**\\*\\* WE HAVE A FULL HOUSE! THANK YOU FOR YOUR INTEREST :)\\*\\***_\n\n**TorontoJS June In-person Social Event**  \nTJS Job Seekers’ Event with Morgan McKinley\n\n\\==================================================\n\nJunior-dev focused job seekers’ event for Toronto JS members.  \nIncludes Interview Preparation info session presented by recruiters of Morgan McKinley - technology recruitment agency.  \nWe will offer resume / portfolio review by members of TorontoJS, professional developers with many years of experience.\n\nQnA session will be followed after the Job search and interview prep presentation delivered by recruiters of Morgan McKinley.  \nThe recruiters will also be available for a short 1:1 consultation on first-come-first-serve basis.\n\nLight refreshments and snacks provided.\n\nIf you are interested in attending this event, you can find the detailed event information **[here](https://docs.google.com/document/d/e/2PACX-1vSQYaYHAsMZKzBZ7cugR-4UXmrmjdqUI5xBJIZAnVwEij_AC-zVhJojr85FfQm7KJ38cllLsb0Rhgxk/pub) .(THE EVENT IS AT FULL CAPACITY NOW! REGISTRATION IS CLOSED. )**\n\nPlease be aware your registration will not be complete until you submit the google form that is available at the end of the event description page!\n\nAttendees who would like to participate in the reviewing session need to submit their resume and portfolio when they register for the event.\n\nIf you have any questions, please join us our slack channel through TorontoJS [website](https://torontojs.com/) and look for organizers! :)\n\nP.S. TorontoJS is migrating to \\[[Guild.host](http://Guild.host)\\]([https://guild.host/torontojs/events](https://guild.host/torontojs/events)) as our new home! Please consider joining us there, as new events will be only available for sign up at the guild platform in the future.\n\nCode of conduct is enforced at all TorontoJS events [https://torontojs.com/p/code\\_of\\_conduct](https://torontojs.com/p/code_of_conduct)"
}