{
  "title": "TorontoJS Tech Talk [Online] - April 25th, 2024 (Apr 25, 2024)",
  "hosts": [
    "Ken B.",
    "sami x."
  ],
  "startDate": "2024-04-25T18:00:00-04:00",
  "endDate": "2024-04-25T18:00:00-04:00",
  "status": "active",
  "locationType": "virtual",
  "image": "https://secure.meetupstatic.com/photos/event/9/e/c/f/600_520060655.webp?w=750",
  "details": "<div class=\"flex items-center justify-between\"><h2 class=\"text-xl font-semibold\">Details</h2></div><div class=\"break-words\"><p class=\"mb-4\">***</p>\n<p class=\"mb-4\">🎉 <strong>TorontoJS Tech Talks are Back Online!</strong> 🎉</p>\n<p class=\"mb-4\"><strong>This Time: Exploring Cognitive Accessibility</strong></p>\n<p class=\"mb-4\">Join us for the exciting return of TorontoJS Tech Talks, now in a virtual format! This session, we're delving into \"The Current State of Cognitive Accessibility,\" a crucial topic for tech enthusiasts, developers, and anyone interested in creating more accessible and inclusive technology. Get ready for an evening of engaging discussions, learning, and networking, all from the comfort of your home.</p>\n<p class=\"mb-4\">👋 <strong>Meet Our Special Guest, Shruti Vellanki</strong></p>\n<p class=\"mb-4\">Shruti will lead a discussion on \"The Current State of Cognitive Accessibility,\" exploring its various aspects and the comprehensive guidelines established by organizations such as the W3C's COGA and Finnish Guidelines. She'll also address the challenges inherent in making technology universally accessible due to the complexity of cognitive accessibility.</p>\n<p class=\"mb-4\"><strong>About Shruti Vellanki:</strong><br>\nShruti is a dedicated Software Engineer with a passion for Front-End Development, Design Systems, Component Libraries, and Accessibility. She's also an avid reader of nonfiction and an active participant in the Toronto Public Library's Culture and Technology Bookclub. Shruti's presentation promises to offer valuable insights and practical strategies for enhancing cognitive accessibility in technology.</p>\n<p class=\"mb-4\"><strong>Event Schedule:</strong></p>\n<ul class=\"pl-5 list-disc mb-4\">\n<li><strong>6:00 pm</strong>- Warm welcome and introduction by TorontoJS<br>\n<strong>6:10 pm</strong> - Presentation by Shruti Vellanki<br>\n<strong>6:40 pm</strong> - Interactive Q&amp;A Session<br>\n<strong>7:00 pm</strong> - Networking Opportunity<br>\n<strong>7:20 PM</strong> - Closing Remarks</li>\n</ul>\n<p class=\"mb-4\">⭐ <strong>Don't miss this opportunity</strong> to deepen your understanding of cognitive accessibility and its impact on technology development. This event will take place on Zoom, bringing together participants from around the world in an inspiring virtual setting.</p>\n<p class=\"mb-4\"><strong>Interested in speaking or sponsoring?</strong> Reach out to us at <a href=\"http://organizers@torontojs.com.\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">organizers@torontojs.com.</a><br>\nTorontoJS is committed to fostering a safe and inclusive environment for everyone, both online and at our events and spaces.<br>\n<strong>We look forward to seeing you there!</strong> 🚀</p>\n<p class=\"mb-4\"><em>Code of Conduct is enforced online or in person at all TorontoJS events and spaces</em></p>\n<p class=\"mb-4\">We are always seeking sponsors and speakers for events similar to this one. If you or your company are interested in supporting TorontoJS or reaching our community, please contact <a href=\"http://organizers@torontojs.com.\" target=\"_blank\" class=\"!text-viridian\" rel=\"nofollow ugc\">organizers@torontojs.com.</a></p></div>",
  "tags": [
    "Events in",
    "Accessibility",
    "JavaScript",
    "Software Development",
    "Web Development",
    "Web Technology"
  ]
}