{
	"title": "JS TechTalk: November edition with Abstract Syntax Trees and more!",
	"hosts": [
		"dann",
		"Matthew M."
	],
	"startDate": "2019-11-25T18:00:00-05:00",
	"endDate": "2019-11-25T18:00:00-05:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nWe are excited to announce our next JS Tech Talk event night!\n\nSpecial thanks to Shopify ([https://shopify.com/](https://shopify.com/)) for providing the space and food for the evening!!\n\n// TALKS\n\n1.  Lightning Talks\n\nThroughout the event we have a few Lightning talks, you will hear from the following folks,\n\n*   Darcy Clarke, Beyond npm install ... Discover capabilities of npm & the npm registry you never knew existed. Darcy is the Engineering Manager for Community & Open Source @ npm inc.\n    \n*   Pradhumna Pancholi, Ethereum and [Web3.js](http://Web3.js)\n    \n*   Dustin Gaudet, React Native with Expo\n    \n\n2.  Haris - Building Native Apps with React\n\nBuilding native mobile apps has always been a black-box for front-end developers. We’re heavily invested in the technologies we already know, and diving into a completely new ecosystem with a huge learning curve is always daunting. React Native aims to solve this problem by providing a framework to build native apps using JavaScript and React. This talk introduces the fundamental concepts and tools that you’ll need to use to build your first native mobile app.\n\nHaris is senior engineer at Shopify where he’s helping build the world of e-commerce, and the founder of Rep It Supply, an apparel, stickers and pins store for developers and internet nerds.”\n\n3.  Nicole Chung and Hunter Janson - Codemods and Abstract Syntax Trees\n\nDescription TBA\n\nNicole Chung is a Senior Software Engineer, Frontend, at League. Before this, Nicole was a Senior Web Application Developer and Tech Lead at TWG. She has written about React for the O'Reilly blog, and spoken at ReactConf, Fluent, and JS Conf Iceland.\n\nHunter is a software developer who makes solutions of all shapes and sizes. Specializing in web technologies, he's most recently been working at League. Hunter has also worked with startups, more established software firms, and open-source projects. When not developing software, he's (maybe not sarcastically) planning his future as a farmer.\n\n// SCHEDULE\n\n6:00pm - Doors open. Grab something to eat and network with attendees.\n\n6:20pm - Opening announcements. News and information about the Toronto JavaScript community and upcoming events.\n\n6:30pm - Dustin Gaudet - Developing in React Native with Expo\n\n6:45pm - Haris - Building Native apps with React\n\n7:20pm - Darcy Clarke - Beyond npm install ... Discover capabilities of npm & the npm registry you never knew existed\n\n7:35pm - Nicole Chung & Hunter Jansen - Codemods and Abstract Syntax Trees\n\n8:05pm - Pradhumna Pancholi - Ethereum and [Web3.js](http://Web3.js)\n\n8:30pm - Closing remarks\n\n8:45pm - Goodbyes, give us a hand cleaning up the space, and post-event drinks at a local pub!\n\n// Note that the schedule is subject to change and accommodates 10-15  \n// minute breaks between sessions.\n\n// Interested in speaking or sponsoring?\n\n// Please email us at [team@torontojs.com](http://team@torontojs.com) for more information. All skill  \n// levels are welcome for talks!\n\n// Join us on Slack: [http://slack.torontojs.com/](http://slack.torontojs.com/)\n\n// Follow us on Twitter: [https://twitter.com/torontojs/](https://twitter.com/torontojs/)\n\n// See you there!"
}
