{
	"title": "JS Lightning Talks: Coding for Design Systems",
	"hosts": [
		"Matthew M.",
		"2 others"
	],
	"startDate": "2021-12-07T18:00:00-05:00",
	"endDate": "2021-12-07T18:00:00-05:00",
	"status": "active",
	"locationType": "virtual",
	"image": null,
	"tags": [
		"Events in",
		"JavaScript Applications",
		"JavaScript Frameworks"
	],
	"details": "Details\n-------\n\nWelcome to JS Lightning Talks! This is a place for JavaScript developers to share new skills and learnings in rapid-fire, quick presentations.\n\nThis event is open to all skill levels.\n\n\"Making the tooltip: A React-only approach to this tiny powerhouse\" by Oiza Baiye\n\nBuilding a reusable tooltip component can be quite complicated, as devs at Bevy discovered while implementing a new design system. Join me on a walk through each problem we encountered and the solutions available in React-land and in the DOM API.\n\n\"Loading Custom Fonts\" By Jen Chan  \nWhat to do when you're not importing a free font from Google Fonts? How to do so to avoid that flash-of-unstyled-text? This is a quick walkthrough of how to do that with Storybook and React components.\n\n\"Children not Props\" by Nicole Chung  \nA short demo of how to use children instead of slot-style props in React.\n\n\"Building a new HashiCorp design system. Step 1: Icons\" by Amy Lam\n\nAmy joined a new Design Systems team in July to kick off a new design system at HashiCorp, serving the flagship products in [Ember.js](http://Ember.js) (Terraform, Vault, Boundary, Consul, Nomad, Waypoint, and HashiCorp Cloud Platform), in addition to marketing and documentation microsites in [Next.js.](http://Next.js.) This talk is about the implementation of a new icon set to deliver a consistent visual language across UIs.\n\n\"Seamless Systems with Modern Monorepos\" by Connor Wilson  \nTake advantage of modern tooling to develop and publish libraries and apps at scale. No linking, no headaches, bootstrap your entire project with one command and focus on building\n\n\"What’s new in Storybook?\" by Varun Vacchar.  \nThousands of devs use Storybook daily to build UI components faster. The latest version brings a perf boost and unlocks new workflows. I’ll give you demo CSF 3 and interactive stories.\n\nSpeakers\n\nOiza Baiye is a frontend engineer at Bevy. She really enjoys CSS. JavaScript is also her jam.  \n[https://ahuoizabaiye.com/](https://ahuoizabaiye.com/)\n\nJen Chan is a software developer at Rangle.  \n[https://jenchan.biz](https://jenchan.biz)\n\nNicole Chung is an engineer at Crowdstrike on the Design Systems and Foundations team.  \n[https://redconservatory.com/](https://redconservatory.com/)\n\nAmy is a product-minded developer with a focus on the frontend. She is a Senior Engineer, Design Systems and Accessibility at HashiCorp. Amy enjoys playing dodgeball, strolling her doge around San Francisco, and growing her houseplant collection.  \n[https://www.amyrlam.com/](https://www.amyrlam.com/)\n\nConnor Wilson is Dev Manager at Hopper. He's building libraries and apps to bring travel fintech to the world.  \n[https://cwlsn.com](https://cwlsn.com)\n\nVarun is DX Engineer at Chromatic and a contributor to Storybook. He specializes in component-driven development, design systems and generative art.  \n[https://varun.ca](https://varun.ca)\n\n\\--------\n\nCode of conduct is enforced at all TorontoJS events [https://torontojs.com/p/code\\_of\\_conduct](https://torontojs.com/p/code_of_conduct)\n\nWanna give a talk or workshop? Tell us about it at [https://tinyurl.com/torontoJS](https://tinyurl.com/torontoJS)\n\nTimetable:\n\n6:00 - doors \"open\"\n\n6:30 - Lightning Talks begin\n\n8:30 - Q&A\n\n9:00 - everyone goes \"home\""
}
