{
	"title": "November Tech Talk Night - WebGL",
	"hosts": [
		"Kate",
		"2 others"
	],
	"startDate": "2013-11-07T19:00:00-05:00",
	"endDate": "2013-11-07T19:00:00-05:00",
	"status": "active",
	"locationType": "in-person",
	"image": null,
	"tags": [
		"Events in Toronto, ON"
	],
	"details": "Details\n-------\n\nNovember! The perfect month for another TorontoJS Tech Talk Night. Grab your jacket, take in a breath of that crisp autumn air, and prepared to be blown away with two awesome talks. Over a slice of pizza, of course. This month we have two sponsors making it possible:\n\nMyplanet Digital ([http://myplanetdigital.com/](http://myplanetdigital.com/)) is a rapidly growing design & technology company specializing in the process and practice of envisioning, designing and building digital products. They'll join us at this month's Meetup to discuss a new education initiative launching in January called World of Webcraft ([http://webcraft.myplanetdigital.com/](http://webcraft.myplanetdigital.com/)). This part-time, 12 week program offers freelancers and junior web developers the opportunity to learn the Myplanet development process. Using Drupal as a CMS, Webcraft participants will take part in hands-on learning for the first month of the program. Participants who demonstrate a solid understanding of the concepts will then be invited to work on real client tasks and will be rewarded using a gamified payment system. It's a great opportunity for anyone looking to enhance their spectrum of web skills- further info will be provided at the Meetup.\n\nYellowAPI ([http://www.yellowapi.com/](http://www.yellowapi.com/))™ (also known as the [YellowPages.ca](http://YellowPages.ca) ([http://www.yellowpages.ca/](http://www.yellowpages.ca/))™ API) is the goto resource for location-based applications • Our curated local search API is built off of the strength of the [YellowPages.ca](http://YellowPages.ca) ([http://www.yellowpages.ca/](http://www.yellowpages.ca/))™ database of over 1.5 million geocoded Canadian business listings and associated rich content • Not only is it free, but we offer ways for you to make money fast. We provide the tools, you provide the ideas and the talent.\n\nDiving In With WebGL - Mike Aquino ([http://mylifeatruntime.com/](http://mylifeatruntime.com/))\n\nAn in-depth introduction to WebGL providing a brief history, a break down of examples outlining the structure of a WebGL app, tips on getting started, and a look at real world use of WebGL covering: prototyping for mobile apps, graphics demos, games, learning tools, and commercial web apps. This talk will be presented by Mike Aquino, a computer graphics veteran in digital art tools development (for video game and feature animation productions) whose early graphics experience in his career involved coding in Irix GL programs on SGI workstations.\n\n101: An Introduction To (nearly) Anything JS - Rob Gilson\n\nThrough a series of crash course introductions this talk follows the journey of one developer as he attempts the supposedly simple plan of building a network protocol for 3D printers and manages to use almost every technology under the sun in the process. Technologies covered will include web workers, chrome apps, typed arrays, the HTML5 file system API and web sockets w/ nodeJS. Rob Gilson is a former Senior Instructor at BitMaker Labs, a YCombinator Alumni and an evangelist of all things bleeding edge.\n\nWe'll also be giving away two tickets to the upcoming FITC Spotlight: Advanced JavaScript event! You can find out more about the giveaway at the Tech Talk Night itself. Find out more about the event on their website: [http://fitc.ca/event/spotlightajs/](http://fitc.ca/event/spotlightajs/)\n\nIf you can't wait and would like to get a ticket now, you can use the discount code: TorontoJS\n\nOr use this link: [http://spotlightadvancedjs.eventbrite.ca/?discount=TorontoJS](http://spotlightadvancedjs.eventbrite.ca/?discount=TorontoJS)\n\nReminder that the Early Bird discounted tickets are only available until November 8th!\n\nSee you there!"
}
